{
  "sources": [
    {
      "title": "BookingSync.com news",
      "feedUrl": "https://changelog.bookingsync.com/rss",
      "siteUrl": "https://changelog.bookingsync.com",
      "articles": [
        {
          "id": "243150",
          "author": "JB, FinOps Product Dept. Director & Core CS Team Lead",
          "description": "New!\n  \nToday, we are glad to announce yet a new feature: a brand new Dashboard section that will allow you to easily manage your daily tasks, directly from your Smily account.\nHere is a sneak peek at what the new Dashboard looks like:\n\nIn the past, managing day to day operations may have been complicated. Tasks such as keeping track of payments, approving pending tentatives and others were time consuming.\nThanks to the Dashboard, you now have access to the following information:\nList of pending tentatives: to help you convert them into confirmed bookings, or cancel them to free up the dates in your calendar\nList of bookings with missing payments: to help you get all your payments on time and never miss a payment again\nList of arrivals of the day: to help you plan the check-in of your guests\nList of departures of the day: to help you plan the check-out of your guests\nYou can find more details in the dedicated manual article, and a video guided tour of the new Dashboard section will soon be added there as well.\nWe invite you to explore this new Dashboard, and hope it will help you save time and better manage your daily operations. Some improvements will also be made in the future, such as adding performance metrics to help you manage your business more easily.",
          "link": "https://changelog.bookingsync.com/new-feature-brand-new-dashboard-section-to-easily-manage-your-daily-tasks-from-smily-243150",
          "publishedOn": "2022-09-06T09:29:41.000Z",
          "wordCount": 479,
          "title": "[New feature] Brand new Dashboard section to easily manage your daily tasks from Smily 🚀",
          "imageUrl": "//cloud.headwayapp.co/changelogs_images/images/big/000/094/521-62e4c3d0e54a8c9d7ed3edb2994d82994e26fd1b.png"
        },
        {
          "id": "241989",
          "author": "Yannick, Customer Care Team Leader - Pro Team",
          "description": "New!\n  \nAt BookingSync, we are here to make you Save time and Book more. That's why we are always thrilled to announce more and more features.\nThis time the new feature concerns the reviews management, you can now manage all your reviews on BookingSync. Yes ! all the reviews posted on the biggest channels : Airbnb, Booking.com plus your direct bookings.\nWhen accessing the Reviews section, you will see 2 different sub-menus:\nGuest Reviews: This section will allow you to see the different reviews posted by the guests for each property, the rating plus the message posted by the guest, if you need more detail you can click on the review, a new page will appear with the Review details, the Booking details, the complete guest review message, and the host review if it’s already posted, and you have the possibility to reply to the review message.\n\n\nHost Reviews: This section will allow you to evaluate your guest and share a detailed rating and a review message.\n\n\nFor each of these section you will be able to filter the reviews by Rating, Rentals and Source.\nPlease find here the video demo explaining step by step the feature.\nWe invite you to discover all these new features, and hope it will help you to have a better management of your reviews, save more time, and have a better ranking and visibility on the channels !\nDon’t hesitate to contact our customer care if you have any questions.",
          "link": "https://changelog.bookingsync.com/new-feature-manage-all-your-reviews-from-your-bookingsync-account-!-241989",
          "publishedOn": "2022-08-25T13:49:11.000Z",
          "wordCount": 488,
          "title": "[New feature] Manage all your reviews from your BookingSync Account !",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Security Bulletins on Tailscale",
      "feedUrl": "https://tailscale.com/security-bulletins/index.xml",
      "siteUrl": "https://tailscale.com/security-bulletins/",
      "articles": []
    },
    {
      "title": "Airbnb API Status - Incident History",
      "feedUrl": "https://airbnbapi.statuspage.io/history.rss",
      "siteUrl": "https://airbnbapi.statuspage.io",
      "articles": [
        {
          "id": "https://airbnbapi.statuspage.io/incidents/cvjp3lxj20n0",
          "author": null,
          "description": "Sep 15, 02:38 PDT\nResolved - This incident has been resolved.\nPlease retry the PUT pricing_settings requests with the desired Standard Fees if you have not already done so.\nIf you have any further queries related to this incident, please submit a ticket via the Partner Support Portal and our team will get back to you as soon as possible.\nApologies for the inconvenience caused and thank you for your understanding.\nSep 14, 22:39 PDT\nMonitoring - Please attempt to retry the PUT pricing_settings requests with the desired Standard Fees.\nThis should re-populate the listings' Standard Fees array as intended, namely the PASS_THROUGH_CLEANING_FEE fee.\nWe are monitoring the situation.\nSep 14, 22:38 PDT\nIdentified - The issue has been identified and mitigated.\nPlease attempt to send a PUT pricing_settings request with the desired Standard Fees as required.\nThis should re-populate the listings' Standard Fees array as intended.\nSep 14, 20:45 PDT\nInvestigating - We are currently investigating reports where the PASS_THROUGH_CLEANING_FEE standard fee is not being able to be set via the Pricing Settings API.\nWe will provide updates as soon as we can. We apologise for the inconvenience caused.",
          "link": "https://airbnbapi.statuspage.io/incidents/cvjp3lxj20n0",
          "publishedOn": "2022-09-15T09:38:05.000Z",
          "wordCount": 3388,
          "title": "Issue Setting PASS_THROUGH_CLEANING_FEE on Pricing Settings Standard Fees Array",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/8l22crftlsb3",
          "author": null,
          "description": "Sep 12, 21:09 PDT\nResolved - Some Partners may have encountered 500 Errors on the Listings API when attempting to API-connect listings to their applications earlier today.\nWe have identified the cause for which a fix has already been implemented. We are not expecting any further errors of such.\nThank you for your understanding and apologies for any inconvenience caused!",
          "link": "https://airbnbapi.statuspage.io/incidents/8l22crftlsb3",
          "publishedOn": "2022-09-13T04:09:19.000Z",
          "wordCount": 3252,
          "title": "Server Errors On Attempt to API-connect Listings",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/ll2yf40bkbfr",
          "author": null,
          "description": "Sep  1, 02:46 PDT\nResolved - This incident has been resolved.\nIf required, please re-push any Pricing Settings Standard Fees updates that may have failed during the incident.\nApologies for any inconvenience caused and thank you for your understanding.\nAug 31, 19:24 PDT\nMonitoring - The cause has been identified and mitigated; the errors should no longer be thrown.\nWe are monitoring the situation.\nApologies for any inconvenience caused.\nAug 30, 23:33 PDT\nInvestigating - We have noticed an elevated rate of 400 Errors on the Pricing Settings endpoint when attempting to update Standard Fees.\nWe are investigating the issue.",
          "link": "https://airbnbapi.statuspage.io/incidents/ll2yf40bkbfr",
          "publishedOn": "2022-09-01T09:46:48.000Z",
          "wordCount": 3302,
          "title": "400 Error on Pricing Settings Endpoint When Updating Standard Fees",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/r4t46rrly1zx",
          "author": null,
          "description": "Aug 23, 15:35 PDT\nResolved - This incident has been resolved. If you come across this issue again, don't hesitate to reach out through the Support Portal.\nAug 22, 16:10 PDT\nMonitoring - We have implemented a fix, and are monitoring the results. If you come across this issue, don't hesitate to reach out through the Support Portal.\nAug 22, 15:21 PDT\nInvestigating - We are investigating an issue that is preventing some images and listings from loading on Airbnb's homepage on airbnb.com, as well as the ability for Hosts to complete some listings. We will post more updates as soon as we have it.",
          "link": "https://airbnbapi.statuspage.io/incidents/r4t46rrly1zx",
          "publishedOn": "2022-08-23T22:35:40.000Z",
          "wordCount": 3303,
          "title": "Issues Loading Listings and Images on Airbnb.com",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/s0xq759f69m5",
          "author": null,
          "description": "Aug 18, 00:00 PDT\nCompleted - The scheduled maintenance has been completed.\nJul 19, 00:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nJul 18, 15:13 PDT\nScheduled - We are currently rolling out improvements to the backend of our Set Listing endpoint for amenities. This will be done in phases over the course of the next month. \nPlease subscribe for deployment updates. We don't expect any change in behavior, but if you come across any issues, please submit an API support request through your Partner Support Portal and link this post.",
          "link": "https://airbnbapi.statuspage.io/incidents/s0xq759f69m5",
          "publishedOn": "2022-08-18T07:00:14.000Z",
          "wordCount": 3287,
          "title": "Listing Amenities Improvements",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Twilio Status - Incident History",
      "feedUrl": "https://status.twilio.com/history.rss",
      "siteUrl": "https://status.twilio.com",
      "articles": [
        {
          "id": "https://status.twilio.com/incidents/tqlzg171y7nq",
          "author": null,
          "description": "Sep 15, 17:01 PDT\nCompleted - The scheduled maintenance has been completed.\nSep 15, 13:01 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nSep 12, 04:30 PDT\nScheduled - The Megafon network in Russia is conducting a planned maintenance from 15 September 2022 at 13:00 PDT until 15 September 2022 at 17:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from Megafon Russia handsets.",
          "link": "https://status.twilio.com/incidents/tqlzg171y7nq",
          "publishedOn": "2022-09-16T00:01:37.000Z",
          "wordCount": 6200,
          "title": "Russia SMS Carrier Maintenance - Megafon",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "DigitalOcean Status - Incident History",
      "feedUrl": "https://status.digitalocean.com/history.rss",
      "siteUrl": "http://status.digitalocean.com",
      "articles": [
        {
          "id": "https://status.digitalocean.com/incidents/jznrv97h9dsw",
          "author": null,
          "description": "Sep 16, 00:17 UTC\nResolved - Our engineering team has resolved the issue with networking in LON1, and should now be operating normally. If you continue to experience problems, please open a ticket with our support team. We apologize for any inconvenience.\nSep 15, 23:36 UTC\nMonitoring - Our Engineering team has identified the root cause of the networking issues in LON1. We are monitoring the situation and will post an update once we confirm this incident is fully resolved.\nSep 15, 22:16 UTC\nIdentified - Our Engineering team has identified the source of connectivity issues in our LON1 region, and is working on a fix to mitigate the impact.\nUsers may be experiencing packet loss/latency, timeouts, and related issues with Droplet-based services in LON1, including Droplets, Managed Kubernetes, and Database clusters.\nSep 15, 22:01 UTC\nInvestigating - Our Engineering team is investigating reports of networking connectivity issues in our LON1 region. Users have reported packet loss/latency and connectivity errors to resources. We will share an update once we have further information.",
          "link": "https://status.digitalocean.com/incidents/jznrv97h9dsw",
          "publishedOn": "2022-09-16T00:17:58.000Z",
          "wordCount": 4616,
          "title": "Network Connectivity in LON1",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/g4wkfk7jxx6m",
          "author": null,
          "description": "Sep 15, 15:55 UTC\nResolved - From 13:50 - 14:50 UTC, our Engineering team observed issues with event processing in all regions. During this time, users may have experienced delays or failures when attempting to process events, such as creation, deletion, resizing, assigning of Reserved IP's, Snapshots, and other Droplet-based events.\nOur Engineering team has resolved the issue. As of 14:50 UTC, events should not be delayed and should be successful.  We apologize for the inconvenience. If you are still experiencing any problems or have additional questions, please open a support ticket within your account.",
          "link": "https://status.digitalocean.com/incidents/g4wkfk7jxx6m",
          "publishedOn": "2022-09-15T15:55:26.000Z",
          "wordCount": 4537,
          "title": "Delay with Event Processing in All Regions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/yhz9frgy4ngl",
          "author": null,
          "description": "Sep 14, 20:46 UTC\nResolved - Our engineering team has resolved the issue with LON1 network connectivity, and should now be operating normally. If you continue to experience problems, please open a ticket with our support team. We apologize for any inconvenience.\nSep 14, 18:54 UTC\nMonitoring - Our Engineering team has deployed a fix to resolve the issues with network connectivity in our LON1 region. At this time, users should be seeing the restoration of network connectivity to and from the resources in LON1. We are monitoring the situation and will post an update as soon as we confirm the issue is fully resolved.\nSep 14, 17:54 UTC\nIdentified - Our Engineering team has investigated reports of connectivity issues beginning around 15:40 UTC in our LON1 region and has taken action to mitigate the impact. \nUsers may have experienced packet loss/latency, timeouts, and related issues with Droplet-based services in LON1, including Droplets, Managed Kubernetes, and Database clusters. \nWe are seeing some recovery after taking action and are continuing to investigate and monitor the situation.",
          "link": "https://status.digitalocean.com/incidents/yhz9frgy4ngl",
          "publishedOn": "2022-09-14T20:46:45.000Z",
          "wordCount": 4621,
          "title": "Network Connectivity in LON1",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/lm2sv23vw0bx",
          "author": null,
          "description": "Sep  7, 20:49 UTC\nResolved - Our Engineering team has confirmed that the issue affecting the creation of Mongo Managed Database clusters has been fully resolved. We appreciate your patience throughout the process and if you continue to experience problems, please open a ticket with our support team for further review.\nSep  7, 20:27 UTC\nMonitoring - Our Engineering team has identified the root cause of the issue with creation of Mongo Managed Database clusters and a fix has been deployed as of 20:07 UTC. We are monitoring the situation and will post an update once we confirm this incident is fully resolved.\nSep  7, 19:50 UTC\nInvestigating - Our Engineering team is investigating an issue with creation of Mongo Managed Database clusters. At this time, users may experience errors in creating clusters, both via Cloud Control Panel and API requests.\nWe apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/lm2sv23vw0bx",
          "publishedOn": "2022-09-07T20:49:46.000Z",
          "wordCount": 4602,
          "title": "Mongo Managed Databases Creation",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/hq7fylkxs9f3",
          "author": null,
          "description": "Sep  7, 20:30 UTC\nResolved - Our engineering team has confirmed that the issue affecting DigitalOcean Container Registry has been fully resolved. We appreciate your patience throughout the process and if you continue to experience problems, please open a ticket with our support team for further review.\nSep  7, 19:55 UTC\nMonitoring - As of 19:18 UTC, our Engineering team has implemented a fix to resolve the issue with DigitalOcean Container Registry. Users should no longer experience errors while interacting and authenticating with the DigitalOcean Container Registry, creating new container registries, and pushing/deleting images to/from registries.\nApp Platform builds should now be succeeding. \nDuring this time users may have experienced errors while creating Spaces keys.\nWe are continuing to monitor the situation for stability and will post an update once we confirm the issue is fully resolved. Thank you for your patience.\nSep  7, 19:20 UTC\nInvestigating - As of 17:20 UTC, our Engineering team is investigating an issue with DigitalOcean Container Registry. At this time, users may experience errors while interacting and authenticating with the DigitalOcean Container Registry, creating new container registries, and pushing/deleting images to/from registries.\nApp Platform users may experience build failures.\nWe apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/hq7fylkxs9f3",
          "publishedOn": "2022-09-07T20:30:01.000Z",
          "wordCount": 4650,
          "title": "Container Registry Errors",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/rsj14bmv86q8",
          "author": null,
          "description": "Sep  7, 16:52 UTC\nCompleted - The scheduled maintenance has been completed. If you have any questions or concerns regarding this maintenance, please send us a ticket from your Cloud support page.\nSep  7, 16:01 UTC\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nSep  7, 15:11 UTC\nScheduled - Start: 2022-09-07 16:00 UTC\nEnd: 2022-09-07 17:00 UTC\nDuring the above window, upstream maintenance will take place that may impact DigitalOcean App Platform.\nExpected Impact:\nDuring this period, App Platform users may experience new App creation failing or being delayed, as well as domain updates to existing Apps failing or being delayed. Our Engineering team will be monitoring throughout the maintenance window for any issues.\nIf you have any questions or concerns regarding this maintenance, please send us a ticket from your Cloud support page.",
          "link": "https://status.digitalocean.com/incidents/rsj14bmv86q8",
          "publishedOn": "2022-09-07T16:52:15.000Z",
          "wordCount": 4589,
          "title": "Upstream Maintenance Impacting App Platform",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/kp648z6hmzjp",
          "author": null,
          "description": "Sep  6, 16:34 UTC\nResolved - Our Engineering team has confirmed full resolution of the issue with networking in our LON1 region. From 12:57 - 15:33 UTC, a subset of Droplet-based services in LON1 experienced network connectivity issues. All services are now operating normally. If you continue to experience problems, please open a ticket with our support team. We apologize for any inconvenience.\nSep  6, 15:14 UTC\nMonitoring - Our Engineering team was able to take action to mitigate the issue with network connectivity in our LON1 region. At this time, users should be seeing restoration of network connectivity to and from Droplet-based resources in LON1. We are monitoring the situation and will post an update as soon as we confirm the issue is fully resolved.\nSep  6, 13:42 UTC\nInvestigating - Our Engineering team is investigating reports of connectivity issues in our LON1 region. At this time, users may see timeouts and/or errors with connectivity to and from Droplet-based resources in LON1, including Droplets, Managed Databases, and Kubernetes clusters. We will post an update with further information as soon as possible.",
          "link": "https://status.digitalocean.com/incidents/kp648z6hmzjp",
          "publishedOn": "2022-09-06T16:34:23.000Z",
          "wordCount": 4625,
          "title": "Networking in LON1",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/sgz90cmyw28j",
          "author": null,
          "description": "Sep  2, 09:13 UTC\nResolved - Our engineering team has confirmed that the issues affecting access to the Cloud Control Panel have been fully resolved. We appreciate your patience throughout the process and if you continue to experience problems, please open a ticket with our support team for further review.\nSep  2, 08:42 UTC\nMonitoring - Our engineering team has implemented a fix to resolve the issue with accessing our Cloud Control Panel and is monitoring the situation. We will post an update as soon as the issue is fully resolved.\nSep  2, 06:36 UTC\nIdentified - Our Engineering team has identified the cause of the issue with accessing the Cloud Control Panel and is actively working on a fix. During this time, users in India might face issues with receiving the authorization code to login to the Cloud Control Panel. We will post an update as soon as additional information is available\nSep  2, 05:19 UTC\nInvestigating - Beginning 04:00 UTC, our Engineering team is investigating an issue with accessing our Cloud Control Panel. During this time, users may experience intermittent errors while trying to login and receive authorization codes to the phone. We apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/sgz90cmyw28j",
          "publishedOn": "2022-09-02T09:13:46.000Z",
          "wordCount": 4656,
          "title": "Cloud Control Panel",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/z7z5dn5grkf2",
          "author": null,
          "description": "Sep  1, 19:09 UTC\nResolved - Our engineering team has confirmed that the issues affecting access to the Cloud Control Panel have been fully resolved. We appreciate your patience throughout the process and if you continue to experience problems, please open a ticket with our support team for further review.\nSep  1, 17:40 UTC\nMonitoring - Our engineering team has completed the rollback and we can confirm that the Cloud Control Panel is now accessible. We are continuing to monitor the situation for stability and will post an update once we confirm the issue is fully resolved. Thank you for your patience.\nSep  1, 17:10 UTC\nIdentified - Our engineering team has identified an issue with accessing our Cloud Control Panel. During this time, users may experience intermittent errors while trying to login or interact with the Cloud Control Panel. Our team has initiated a rollback to mitigate the issue and we will post an update as soon as possible. We apologize for the inconvenience.",
          "link": "https://status.digitalocean.com/incidents/z7z5dn5grkf2",
          "publishedOn": "2022-09-01T19:09:15.000Z",
          "wordCount": 4607,
          "title": "Cloud Control Panel",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/pf9hyyx5rkbc",
          "author": null,
          "description": "Aug 26, 20:30 UTC\nResolved - Beginning 14:21 UTC, App Platform deployments in all regions were degraded. Users may have experienced up to 90 minutes of delay in Apps deploying, seeing \"Deploy pending\" messages in the control panel. Existing Apps were not impacted and remained online. As of 16:05 UTC, our team has fully resolved this issue and all stuck deployments were pushed through. No action is required from users. If you continue to experience any issues, please open a support ticket from within your account.",
          "link": "https://status.digitalocean.com/incidents/pf9hyyx5rkbc",
          "publishedOn": "2022-08-26T20:30:00.000Z",
          "wordCount": 4517,
          "title": "App Platform Deployments",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/798hgn4bv6dh",
          "author": null,
          "description": "Aug 25, 20:04 UTC\nResolved - Our Engineering team has resolved the issue with Block Storage Volumes. All the operations including creation, deletion, and listing should now be succeeding. We appreciate your patience throughout the process and if you continue to experience problems, please open a ticket with our support team for further review.\nAug 25, 18:59 UTC\nMonitoring - Our engineering team has implemented a fix to resolve the issue with Block Storage Volumes. We are currently monitoring the results and will post an update as soon as the matter is resolved completely.\nAug 25, 17:35 UTC\nInvestigating - Our engineering team is investigating an issue with Block Storage Volumes. During this time users may experience issues while creating, listing, and deleting the Block Storage Volumes in all regions. We apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/798hgn4bv6dh",
          "publishedOn": "2022-08-25T20:04:47.000Z",
          "wordCount": 4589,
          "title": "Block Storage Volumes",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/4y1rgp5qlxyl",
          "author": null,
          "description": "Aug 23, 02:54 UTC\nResolved - Our engineering team has confirmed full resolution of the issue with the Cloud Control Panel, API, and Event Processing, and all services should now be operating normally. If you continue to experience problems, please open a ticket with our support team. We apologize for any inconvenience.\nAug 23, 02:20 UTC\nMonitoring - Our Engineering team identified an issue impacting the Cloud Control Panel, API, and event processing in all regions. From 2:01 - 2:12 UTC, users may have experienced high error rates with issuing event and API requests and been unable to load the Control Panel. A fix has been implemented and we are monitoring the situation. We will post an update once we confirm the issue is fully resolved.",
          "link": "https://status.digitalocean.com/incidents/4y1rgp5qlxyl",
          "publishedOn": "2022-08-23T02:54:57.000Z",
          "wordCount": 4581,
          "title": "Cloud Control Panel, API, Event Processing",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/8s0lbx5kq4n0",
          "author": null,
          "description": "Aug 23, 00:36 UTC\nResolved - Our engineering team has resolved the issue with Managed Database Clusters. All database systems should now be operating normally. If you continue to experience problems, please open a ticket with our support team. We apologize for any inconvenience.\nAug 22, 23:58 UTC\nMonitoring - Our engineering team has implemented a fix to resolve the issue with Managed Database Clusters and is monitoring the situation. We will post an update as soon as the issue is fully resolved.\nAug 22, 23:02 UTC\nInvestigating - Our engineering team is investigating an issue with Managed Database Clusters. At this time, users will be unable to list or modify clusters in the control panel and will not be able to check the status of a cluster via monitoring. This should not impact the functionality of a currently running database cluster. \nWe apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/8s0lbx5kq4n0",
          "publishedOn": "2022-08-23T00:36:36.000Z",
          "wordCount": 4598,
          "title": "Managed Database Clusters.",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/sgld81wmh9gz",
          "author": null,
          "description": "Aug 19, 14:28 UTC\nResolved - Between 9:50 - 13:00 UTC, users were unable to load the Managed Kubernetes page in the Cloud Panel. Our Engineering team has fully resolved this issue and all services are functioning correctly. \nIf you continue to experience problems, please open a ticket with our support team. We apologise for any inconvenience.\nAug 19, 13:16 UTC\nMonitoring - Our Engineering team has implemented a fix to resolve the issue with functionality of the Managed Kubernetes page in the Cloud Panel and is monitoring the situation. We will post an update as soon as the issue is fully resolved.\nAug 19, 13:05 UTC\nInvestigating - Our Engineering team is investigating an issue with the functionality of the Managed Kubernetes page in the Cloud Panel. During this time, users will experience a white page while accessing the Kubernetes dashboard. Cluster functionality remains unaffected and users may utilize the API to manage their clusters. We apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/sgld81wmh9gz",
          "publishedOn": "2022-08-19T14:28:27.000Z",
          "wordCount": 4614,
          "title": "Managed Kubernetes Dashboard",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Notion Status - Incident History",
      "feedUrl": "https://status.notion.so/history.rss",
      "siteUrl": "https://status.notion.so",
      "articles": [
        {
          "id": "https://status.notion.so/incidents/39kmxh87vh8j",
          "author": null,
          "description": "Aug 23, 12:25 PDT\nResolved - This incident has been resolved. Users should no longer experience performance degradation.\nAug 22, 17:15 PDT\nUpdate - Our engineers are continuing to investigate the root cause of the issue. Currently, we expect the issue to be resolved for all users.\nAug 22, 12:01 PDT\nInvestigating - Notion is experiencing degradation in performance and preventing some users from accessing their content. We are currently investigating this issue.",
          "link": "https://status.notion.so/incidents/39kmxh87vh8j",
          "publishedOn": "2022-08-23T19:25:18.000Z",
          "wordCount": 2791,
          "title": "Performance Degradation",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/lc049xb3mnq4",
          "author": null,
          "description": "Aug 22, 04:11 PDT\nResolved - Notion experienced an outage between 3:18am PT and 3:57am PT, but has recovered.",
          "link": "https://status.notion.so/incidents/lc049xb3mnq4",
          "publishedOn": "2022-08-22T11:11:26.000Z",
          "wordCount": 2733,
          "title": "Notion outage",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Rippling Status - Incident History",
      "feedUrl": "https://status.rippling.com/history.rss",
      "siteUrl": "https://status.rippling.com",
      "articles": [
        {
          "id": "https://status.rippling.com/incidents/6ks7txt5h14x",
          "author": null,
          "description": "Sep 15, 22:45 UTC\nMonitoring - A fix has been deployed and is being rolled out.  Please expect the fix to be available to all computers by 6pm PST, some computers may receive the fix earlier.\nSep 15, 20:17 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nSep 15, 19:52 UTC\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/6ks7txt5h14x",
          "publishedOn": "2022-09-15T22:45:33.000Z",
          "wordCount": 4059,
          "title": "Rippling Devices web application is not confirming the creation of user accounts and not sending temporary passwords",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/5lqwzddl4s93",
          "author": null,
          "description": "Sep  6, 23:22 UTC\nResolved - This incident has been resolved.\nSep  6, 22:48 UTC\nIdentified - The issue has been identified and a fix is being implemented.",
          "link": "https://status.rippling.com/incidents/5lqwzddl4s93",
          "publishedOn": "2022-09-06T23:22:27.000Z",
          "wordCount": 3977,
          "title": "Devices page not accessible",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/76kltvl4gcbh",
          "author": null,
          "description": "Aug 22, 19:44 UTC\nResolved - This incident has been resolved.\nAug 22, 18:28 UTC\nMonitoring - A fix has been implemented and we are monitoring the results.\nAug 22, 17:04 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nAug 22, 16:57 UTC\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/76kltvl4gcbh",
          "publishedOn": "2022-08-22T19:44:13.000Z",
          "wordCount": 4031,
          "title": "Popup appearing every 2 minutes on Windows computers managed by Rippling",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/27rtqmdvry5f",
          "author": null,
          "description": "Aug 18, 20:39 UTC\nResolved - This incident has been resolved. Any reconnections should be successful.\nAug 18, 00:06 UTC\nMonitoring - We've rolled back updates to our OAuth library and we're currently monitoring reconnections. If you reconnected your installation prior to 4:45pm PST August 17, 2022, you may receive an additional reconnection notice.\nAug 17, 23:43 UTC\nIdentified - We've identified the underlying issue and are currently releasing the corresponding fix.\nAug 17, 17:58 UTC\nInvestigating - Some customers are reporting issues connecting Rippling to Google Workspace. We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/27rtqmdvry5f",
          "publishedOn": "2022-08-18T20:39:33.000Z",
          "wordCount": 4050,
          "title": "Issues connecting to Google Workspace",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        }
      ]
    },
    {
      "title": "Google Workspace Status Dashboard Updates",
      "feedUrl": "https://www.google.com/appsstatus/dashboard/en/feed.atom",
      "siteUrl": "https://www.google.com/appsstatus/dashboard/",
      "articles": [
        {
          "id": "https://www.google.com/appsstatus/dashboard/incidents/eUTgyZ1F5JxbhTX6bQAD",
          "author": null,
          "description": "<p> Incident began at <strong>2022-09-04 04:00</strong> and ended at <strong>2022-09-07 14:36</strong> <span>(times are in <strong>Coordinated Universal Time (UTC)</strong>).</span></p><div class=\"cBIRi14aVDP__status-update-text\"><h2>INCIDENT REPORT</h2>\n<p><strong>Summary:</strong></p>\n<p>On Saturday, 03 September 2022 21:00 US/Pacific, Google Calendar experienced an issue with a mismatch in Daylight Savings time in Chile for a duration of 3 days, 22 hours, 36 minutes. The issue was mitigated on Wednesday, 07 September 2022 07:36 US/Pacific. We have conducted an internal investigation and are taking steps to improve our service.</p>\n<p><strong>Root Cause:</strong></p>\n<p>Internet Assigned Numbers Authority (also known as IANA) is a standards organization that oversees global IP address allocation, autonomous system number allocation, root zone management in the Domain Name System (DNS), media types, and other Internet Protocol-related symbols and Internet numbers. As part of its mission, IANA maintains global time zone information [1], commonly known as the time zone database, the Olson time zone database, or just the “tzdb”. This database is not released on a schedule, just when global time zone changes require it.</p>\n<p>Chile had a scheduled time zone change on Sunday, 04 September 2022. However, because of elections occurring around the same time, the government decided to postpone the start date of Daylight Savings time from Sunday, 04 September 2022 to Sunday, 11 September 2022. The Chilean government announced this decision on 08 August 2022, less than a month in advance.</p>\n<p>IANA released version 2022b of the time zone database on Thursday, 11 August 2022, followed by 2022c (to address technical issues) on Tuesday, 16 August 2022. Google integrates new versions of the time zone database as they become available in a multi-step process involving several teams. It takes approximately one month for time zone database changes to roll out for Google Calendar.</p>\n<p>[1] - <a href=\"https://www.iana.org/time-zones\">https://www.iana.org/time-zones</a></p>\n<p><strong>Remediation</strong></p>\n<p>Google engineers expedited a roll out of the new time zone definitions on the morning of Wednesday, 07 September 2022 (local Chilean time). This had the following effects:</p>\n<ul>\n<li>The current time in Calendar (the red bar) would be correct.</li>\n<li>New events would appear at the correct time and be in the correct time zone.</li>\n<li>Appointment schedules would appear at the correct time.</li>\n<li>Modified recurring events would appear at the correct time, but instance-specific data (ie. attendee, attendee status, description, location, time, etc.) which did not match the timezone definition would be deleted and new instances would be created in the correct time zone.</li>\n</ul>\n<p><strong>Prevention</strong></p>\n<p>Google is committed to preventing recurrence by implementing the following action items:</p>\n<ul>\n<li>Implement improvements to the time zone updates rollout process that will reduce the lead time for completion.</li>\n<li>Investigate Calendar interactions with other Workspace products with relation to mismatched time zones to minimize impact in case of a recurrence.</li>\n</ul>\n<p><strong>Detailed Description of Impact:</strong></p>\n<p>From 03 September 2022 21:00 to 07 September 2022 07:36 US/Pacific, Google Calendar events for all customers in Chile were impacted due to the time change event.</p>\n<p>The customer impact included:</p>\n<ul>\n<li>The current time in Calendar (the red bar) was out of sync with actual time and the operating system.</li>\n<li>New and existing events were at the wrong time.</li>\n<li>Appointments were set at the wrong time.</li>\n<li>Appointments created across time zones displayed at the wrong time.</li>\n<li>Updating appointment schedules displayed at the wrong time.</li>\n<li>Mobile applications and devices displayed events at the wrong time.</li>\n</ul>\n<hr>\n</div><hr><p>Affected products: Google Calendar</p>",
          "link": "https://www.google.com/appsstatus/dashboard/incidents/eUTgyZ1F5JxbhTX6bQAD",
          "publishedOn": "2022-09-14T14:01:01.000Z",
          "wordCount": 1377,
          "title": "RESOLVED: We're aware of a problem with Google Calendar affecting a significant subset of users. We will provide an update by Sep 6, 2022, 7:07 AM UTC detailing when we expect to resolve the problem. Please note that this resolution time is an estimate and may change.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "GitHub Status - Incident History",
      "feedUrl": "https://www.githubstatus.com/history.rss",
      "siteUrl": "https://www.githubstatus.com",
      "articles": [
        {
          "id": "https://www.githubstatus.com/incidents/8blgv351d71j",
          "author": null,
          "description": "Sep 14, 18:05 UTC\nResolved - This incident has been resolved.\nSep 13, 15:57 UTC\nInvestigating - We are investigating and mitigating intermittent availability issues on some GitHub services.",
          "link": "https://www.githubstatus.com/incidents/8blgv351d71j",
          "publishedOn": "2022-09-14T18:05:27.000Z",
          "wordCount": 3979,
          "title": "Incident on 2022-09-13",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/3z36qpp2c0z1",
          "author": null,
          "description": "Sep 13, 16:08 UTC\nResolved - This incident has been resolved.\nSep 13, 15:10 UTC\nInvestigating - We are investigating reports of degraded performance for Issues.",
          "link": "https://www.githubstatus.com/incidents/3z36qpp2c0z1",
          "publishedOn": "2022-09-13T16:08:25.000Z",
          "wordCount": 3980,
          "title": "Incident with Issues",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/p38y9j23bt7b",
          "author": null,
          "description": "Sep  9, 01:12 UTC\nResolved - This incident has been resolved.\nSep  9, 00:53 UTC\nUpdate - Mitigation efforts are continuing and we are seeing signs of recovery for some affected users.\nSep  8, 23:41 UTC\nUpdate - We are continuing to mitigate the issue impacting some of our customers.\nSep  8, 22:10 UTC\nUpdate - We have identified the source of the issue impacting some of our customers. We continue to mitigate the issue.\nSep  8, 21:04 UTC\nUpdate - We found an issue that impacts some customers. We are working on a mitigation.\nSep  8, 19:44 UTC\nInvestigating - We are investigating reports of degraded performance for Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/p38y9j23bt7b",
          "publishedOn": "2022-09-09T01:12:28.000Z",
          "wordCount": 4077,
          "title": "Incident with Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/pz0bvrjx9ztp",
          "author": null,
          "description": "Sep  8, 00:00 UTC\nResolved - This incident has been resolved.\nSep  7, 15:04 UTC\nInvestigating - We are investigating and mitigating intermittent availability issues on some GitHub services.",
          "link": "https://www.githubstatus.com/incidents/pz0bvrjx9ztp",
          "publishedOn": "2022-09-08T00:00:10.000Z",
          "wordCount": 3985,
          "title": "Incident on 2022-09-07 15:04 UTC",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/sqcs1d0yk16q",
          "author": null,
          "description": "Sep  7, 16:16 UTC\nResolved - This incident has been resolved.\nSep  7, 15:02 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/sqcs1d0yk16q",
          "publishedOn": "2022-09-07T16:16:19.000Z",
          "wordCount": 3980,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/1nyvf21q5dn7",
          "author": null,
          "description": "Sep  7, 12:21 UTC\nResolved - This incident has been resolved.\nSep  7, 11:55 UTC\nInvestigating - We are investigating reports of degraded performance for Issues.",
          "link": "https://www.githubstatus.com/incidents/1nyvf21q5dn7",
          "publishedOn": "2022-09-07T12:21:11.000Z",
          "wordCount": 3980,
          "title": "Incident with Issues",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/d181frs643d4",
          "author": null,
          "description": "Sep  7, 08:45 UTC\nResolved - This incident has been resolved.\nSep  7, 07:59 UTC\nUpdate - We continuing to identify an issue that impacts Package customers using Actions and are working on mitigation. We will continue to keep you updated on progress.\nSep  7, 07:16 UTC\nUpdate - Packages is still experiencing degraded availability. We are continuing to investigate.\nSep  7, 06:39 UTC\nUpdate - We are investigating reports of issues with service(s): Packages accessed from GitHub Actions. We will continue to keep users updated on progress towards mitigation.\nSep  7, 05:56 UTC\nInvestigating - We are investigating reports of degraded performance for Packages.",
          "link": "https://www.githubstatus.com/incidents/d181frs643d4",
          "publishedOn": "2022-09-07T08:45:22.000Z",
          "wordCount": 4065,
          "title": "Incident with Packages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/wl09fvhb20x8",
          "author": null,
          "description": "Sep  7, 00:08 UTC\nResolved - Everything is operating normally.\nSep  6, 22:56 UTC\nInvestigating - We are investigating reports of degraded performance for all GitHub Services.",
          "link": "https://www.githubstatus.com/incidents/wl09fvhb20x8",
          "publishedOn": "2022-09-07T00:08:33.000Z",
          "wordCount": 4005,
          "title": "Incident on 2022-09-06 22:56 UTC",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/cwp52gsftl5n",
          "author": null,
          "description": "Sep  6, 22:20 UTC\nResolved - Everything is operating normally.\nSep  6, 22:05 UTC\nInvestigating - We are investigating reports of degraded performance for all GitHub Services.",
          "link": "https://www.githubstatus.com/incidents/cwp52gsftl5n",
          "publishedOn": "2022-09-06T22:20:01.000Z",
          "wordCount": 4005,
          "title": "Incident on 2022-09-06 22:05 UTC",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/hjxtlk3fvr09",
          "author": null,
          "description": "Aug 29, 18:31 UTC\nResolved - This incident has been resolved.\nAug 29, 18:24 UTC\nUpdate - We identified an issue that impacts most Codespaces customers. We have fully deployed a mitigation and are observing improved success rates for Codespaces creation and resumption operations.\nAug 29, 18:21 UTC\nUpdate - Codespaces is now experiencing degraded performance. We are continuing to investigate.\nAug 29, 17:48 UTC\nUpdate - We identified an issue that impacts most Codespaces customers. We have authored a mitigation that will be deployed within 30 minutes. We will continue to keep you updated on progress.\nAug 29, 17:16 UTC\nUpdate - We identified an issue that impacts most Codespaces customers. We are authoring a mitigation that will be deployed within one hour. We will continue to keep you updated on progress.\nAug 29, 16:34 UTC\nUpdate - We identified an issue that impacts most Codespaces customers. We are authoring a mitigation that will be deployed within 90 minutes. We will continue to keep you updated on progress.\nAug 29, 16:02 UTC\nUpdate - We identified an issue that impacts most Codespaces customers. We are authoring a mitigation that will be deployed within two hours. We will continue to keep you updated on progress.\nAug 29, 15:21 UTC\nUpdate - We continuing to identify an issue that impacts most Codespaces customers and are working on mitigation. We will continue to keep you updated on progress.\nAug 29, 14:19 UTC\nUpdate - Codespaces is now experiencing degraded availability. We are continuing to investigate.\nAug 29, 13:37 UTC\nUpdate - We identified an issue that impacts many Codespaces customers and are working on mitigation. We will continue to keep you updated on progress.\nAug 29, 12:51 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/hjxtlk3fvr09",
          "publishedOn": "2022-08-29T18:31:33.000Z",
          "wordCount": 4269,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/qjf5mzdcp335",
          "author": null,
          "description": "Aug 25, 23:35 UTC\nResolved - This incident has been resolved.\nAug 25, 23:32 UTC\nUpdate - Pages is operating normally.\nAug 25, 23:11 UTC\nUpdate - Pages is experiencing degraded performance. We are continuing to investigate.\nAug 25, 23:11 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/qjf5mzdcp335",
          "publishedOn": "2022-08-25T23:35:05.000Z",
          "wordCount": 4016,
          "title": "Incident with Actions and Pages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/v7x4r4mplb4t",
          "author": null,
          "description": "Aug 25, 15:29 UTC\nResolved - This incident has been resolved.\nAug 25, 15:12 UTC\nUpdate - We've applied a mitigation to resolve the identified issue. Will update further when confirmed that this has resolved the issue.\nAug 25, 14:45 UTC\nUpdate - GitHub Actions is experiencing degraded job execution throughput for a subset of users. We are working to resolve this as quickly as possible.\nAug 25, 14:10 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/v7x4r4mplb4t",
          "publishedOn": "2022-08-25T15:29:45.000Z",
          "wordCount": 4039,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/pmw828sz2w7k",
          "author": null,
          "description": "Aug 24, 18:26 UTC\nResolved - This incident has been resolved.\nAug 24, 18:09 UTC\nUpdate - Actions is experiencing degraded performance. We are continuing to investigate.\nAug 24, 18:09 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/pmw828sz2w7k",
          "publishedOn": "2022-08-24T18:26:50.000Z",
          "wordCount": 3998,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/fhx2r88mzbyv",
          "author": null,
          "description": "Aug 21, 19:18 UTC\nResolved - This incident has been resolved.\nAug 21, 19:02 UTC\nUpdate - We have partially restored Codespaces port forwarding and are working to fully resolve the impact in all regions.\nAug 21, 17:57 UTC\nUpdate - We are continuing to investigate impact to Codespaces port forwarding.\nAug 21, 17:07 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/fhx2r88mzbyv",
          "publishedOn": "2022-08-21T19:18:11.000Z",
          "wordCount": 4024,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/mqmzg413z93k",
          "author": null,
          "description": "Aug 20, 03:24 UTC\nResolved - This incident has been resolved.\nAug 20, 03:04 UTC\nInvestigating - We are investigating reports of degraded performance for API Requests.",
          "link": "https://www.githubstatus.com/incidents/mqmzg413z93k",
          "publishedOn": "2022-08-20T03:24:58.000Z",
          "wordCount": 3985,
          "title": "Incident with API Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/8gpymn7rystj",
          "author": null,
          "description": "Aug 18, 17:36 UTC\nResolved - This incident has been resolved.\nAug 18, 16:38 UTC\nUpdate - We are continuing to work to restore Actions to full health.\nAug 18, 15:58 UTC\nUpdate - We are continuing to work to mitigate intermittent job failures.\nAug 18, 15:25 UTC\nUpdate - We are investigating reports of issues with service(s): Actions, API Requests. We will continue to keep users updated on progress towards mitigation.\nAug 18, 15:17 UTC\nUpdate - API Requests is experiencing degraded performance. We are continuing to investigate.\nAug 18, 14:33 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/8gpymn7rystj",
          "publishedOn": "2022-08-18T17:36:32.000Z",
          "wordCount": 4066,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/2nd6fyb4drjx",
          "author": null,
          "description": "Aug 17, 17:27 UTC\nResolved - This incident has been resolved.\nAug 17, 17:19 UTC\nInvestigating - We are investigating reports of degraded performance for Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/2nd6fyb4drjx",
          "publishedOn": "2022-08-17T17:27:24.000Z",
          "wordCount": 3985,
          "title": "Incident with Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        }
      ]
    },
    {
      "title": "Slack System Status",
      "feedUrl": "https://status.slack.com/feed/rss",
      "siteUrl": "https://status.slack.com/",
      "articles": [
        {
          "id": "https://status.slack.com//2022-09/c3bf22ba48b2930b",
          "author": null,
          "description": "Issue summary:\n\r\n\r\nStarting September 6th, 2022, we identified an issue with the Google Sheet app inside Workflow Builder. This issue caused the app to read the spreadsheet date/time format wrong, inserting the incorrect time value in the timestamp.\n\r\n\r\nWe discovered this was due to the app processing the workflow step with a single digit value instead of a double digit value.\n\r\n\r\nUsers can continue highlighting the Submission Time column in the spreadsheet and select Format → Number → Custom Number Format and insert: ddd mmm yyyy hh:mm:ss, as a workaround.\n\r\n\r\nWe will work to fix this through a bug ticket that has been filed as a result of this incident. Though we have not resolved this issue yet, we will provide further updates through customer support tickets with the impacted users.",
          "link": "https://status.slack.com//2022-09/c3bf22ba48b2930b",
          "publishedOn": "2022-09-15T17:32:19.000Z",
          "wordCount": 349,
          "title": "Incident: Spreadsheet data added using workflows may be incorrect",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-09/29f29ddbaf35791a",
          "author": null,
          "description": "Thank you for your patience while we were working on this. For now, we will track this internally as a bug while we continue to find resolution. If you’re still experiencing this behaviour, please reach out to us at feedback@slack.com.",
          "link": "https://status.slack.com//2022-09/29f29ddbaf35791a",
          "publishedOn": "2022-09-15T00:42:43.000Z",
          "wordCount": 188,
          "title": "Incident: Some users might have trouble with posts",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-09/abdf34f4cfab096e",
          "author": null,
          "description": "Issue summary:\n\r\n\r\nOn September 13, 2022 from 10:33 AM PDT to 3:21 PM PDT, some customers were unable to see group direct messages in their sidebars due to a recent update. Reverting the update fixed the issue for all affected customers.",
          "link": "https://status.slack.com//2022-09/abdf34f4cfab096e",
          "publishedOn": "2022-09-14T06:21:17.000Z",
          "wordCount": 161,
          "title": "Incident: Direct Messages with three or more people are missing from the Direct Message list for all workspaces",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-09/f4273fe54d4adbcb",
          "author": null,
          "description": "Issue summary:\n\r\nOn September 1st, 2022 from around 6:28 am to September 7th, 2022 around 3:00 pm PDT, some users on the Slack desktop app version 4.28.171 installed via the Windows Store were receiving an error when attempting to connect to Slack. \n\r\n\r\nWe determined the cached information typically used to launch the app became corrupted, and subsequently caused the app to not load through a network request, prompting an error instead of re-trying the connection. We then launched a fix that allowed the app to re-attempt a network request, which solved the issue.",
          "link": "https://status.slack.com//2022-09/f4273fe54d4adbcb",
          "publishedOn": "2022-09-08T22:09:38.000Z",
          "wordCount": 465,
          "title": "Incident: Windows Store app users may experience an error when launching Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-09/80573d91231d5ea0",
          "author": null,
          "description": "Issue summary:\n\r\nOn September 8th, 2022 from around 6:44 AM to 7:10 AM PDT some users on desktop clients experienced issues with drafting their messages and saw unexpected character replacements when links with quotes were used. This was caused by an update that was launched and reverting it fixed the issue for all affected users.",
          "link": "https://status.slack.com//2022-09/80573d91231d5ea0",
          "publishedOn": "2022-09-08T19:46:36.000Z",
          "wordCount": 215,
          "title": "Incident: Some users may experience issues drafting a message that contains a link/hyperlink",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-09/ea1c1840310f6593",
          "author": null,
          "description": "Our service provider has resolved the issue and email ticket creation is now working as expected. \n\r\n\r\nThank you for your patience while we sorted this out.",
          "link": "https://status.slack.com//2022-09/ea1c1840310f6593",
          "publishedOn": "2022-09-06T20:05:21.000Z",
          "wordCount": 104,
          "title": "Notice: Email ticket creation may not be working.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/aeda713fb0151d46",
          "author": null,
          "description": "Issue summary:\n\r\nFrom August 31, 2022 at 7:24 PM PDT to September 1, 2022 at 12:15 AM PDT, some customers experienced visual trouble with the Slack interface. Multiple message attachments overlapped, making them inaccessible. \n\r\n\r\nWe traced this to a recent code change, which we reversed — resolving trouble for all affected users.",
          "link": "https://status.slack.com//2022-08/aeda713fb0151d46",
          "publishedOn": "2022-09-03T00:22:32.000Z",
          "wordCount": 216,
          "title": "Incident: Issues with the Slack interface",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/ed2b06a765317908",
          "author": null,
          "description": "Issue summary:\n\r\nFrom Monday August 29 at 10:11 AM PDT to Wednesday August 31st at 12:42 PM PDT, some Grid customers were running into errors when configuring SSO settings for their workspaces. Upon investigation, we identified an issue that was resulting in empty SAML configuration files. These empty files triggered the errors seen by users.\n\r\n\r\nRemoving the offending file fixed the issue for all affected users.",
          "link": "https://status.slack.com//2022-08/ed2b06a765317908",
          "publishedOn": "2022-08-31T22:32:48.000Z",
          "wordCount": 215,
          "title": "Incident: Issues setting up SSO for some users.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/09a013b17a720bc4",
          "author": null,
          "description": "Issue summary: \n\r\nFrom August 29, 2022 at 11:26 AM PDT to August 30, 2022 at 3:56 PM PDT, some customers may have experienced issues with their Mark as Read preferences, and intermittent issues loading channel history.\n\r\n\r\nWhen you view a channel, Slack remembers your last scroll position so we can take you back to the same place. A recent feature update inadvertently bypassed the check for this scroll position, creating the impression that Slack wasn't respecting your Mark as Read preference. Additionally, this incorrectly prevented channel history from loading for some users.\n\r\n\r\nWe identified the root cause and rolled this code change back, resolving the issue for all affected customers.",
          "link": "https://status.slack.com//2022-08/09a013b17a720bc4",
          "publishedOn": "2022-08-31T02:40:16.000Z",
          "wordCount": 275,
          "title": "Incident: Mark as Read preferences not being respected",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/1afbcbaeecc2f6a8",
          "author": null,
          "description": "Issue Summary: \n\r\nOn August 25, 2022 between 11:31 AM PDT and 12:37 PM PDT, some customers experienced trouble loading the Workflow Builder screen.\n\r\n\r\nWe traced the problem to a change in the front-end Workflow Builder components which prevented the Workflow Builder from starting up successfully. We reverted this, resolving the issue for all affected customers.",
          "link": "https://status.slack.com//2022-08/1afbcbaeecc2f6a8",
          "publishedOn": "2022-08-25T23:06:37.000Z",
          "wordCount": 146,
          "title": "Incident: Workflow Builder screen not loading",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/fffc131e21aa14a4",
          "author": null,
          "description": "Issue Summary:\n\r\nFrom August 22, 2022 5:15 PM PDT to August 23, 2022 01:15 AM PDT, some customers experienced a persistent reload prompt when when their user account was converted from a member account to a guest account, even after a reload was completed.\n\r\n\r\nA recent change made to our code resulted in the removal of a mechanism for indicating when a reload dialogue should appear. We have pushed a fix for this problem by reinstating the mechanism to ensure this only occurs for users once.",
          "link": "https://status.slack.com//2022-08/fffc131e21aa14a4",
          "publishedOn": "2022-08-24T18:00:36.000Z",
          "wordCount": 238,
          "title": "Incident: Some users are encountering a \"Reload required\" message",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/477ba9fefe50a765",
          "author": null,
          "description": "Issue Summary:\n\r\n\r\nOn August 23, 2022 between 12:17 PM PDT and 1:32 PM PDT, some customers experienced difficulty with loading Slack and sending messages. This occurred when a group of database servers became overloaded and failed.\n\r\n\r\nWe first reduced the load on our infrastructure manually. The issue was then resolved when our automated processes kicked in, replacing the damaged server with a healthy one. While the issue is resolved, we will continue to investigate the root cause to avoid these problems in the future.",
          "link": "https://status.slack.com//2022-08/477ba9fefe50a765",
          "publishedOn": "2022-08-24T16:07:01.000Z",
          "wordCount": 223,
          "title": "Incident: Trouble loading and sending messages in Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2022-08/1e5a17ebecd2bda4",
          "author": null,
          "description": "Issue Summary: \n\r\nFrom August 19, 2022 11:55 AM PDT to August 22, 2022 2:52 AM PDT some users experienced issues using the buttons on interactive messages. \n\r\n\r\nWe traced the issue to a recent code change, which we rolled back, resolving the issue for all impacted users.",
          "link": "https://status.slack.com//2022-08/1e5a17ebecd2bda4",
          "publishedOn": "2022-08-22T17:11:30.000Z",
          "wordCount": 156,
          "title": "Incident: Errors with interactive messages",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}