{
  "sources": [
    {
      "title": "BookingSync.com news",
      "feedUrl": "https://changelog.bookingsync.com/rss",
      "siteUrl": "https://changelog.bookingsync.com",
      "articles": [
        {
          "id": "270079",
          "author": "Yannick, Customer Care Team Leader - Pro Team",
          "description": "Improvement\n  \nWe’re happy to announce that we just upgraded our Invoicing app with several improvements. \nHere are the highlights of what you can expect from the latest update:\nBetter User Experience\nWe’ve improved the app to make it more intuitive and user-friendly, with a smoother navigation flow.\nEnhanced Stability\nOur developers have put in significant effort to ensure the app’s stability and avoid unexpected crashes or performance hiccups.\nImproved Search Function\nFinding invoices and relevant information is now quicker and more precise.\nCleaner Interface\nWe understand the importance of a clutter-free interface. The app now flaunts a cleaner and more modern look that ensures a visually appealing invoicing experience.\nAs always, our customer support team is here to assist you should you have any questions or encounter any issues.",
          "link": "https://changelog.bookingsync.com/improvements-of-our-invoicing-app-270079",
          "publishedOn": "2023-07-21T11:15:24.000Z",
          "wordCount": 360,
          "title": "Improvements of our Invoicing app",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Security Bulletins on Tailscale",
      "feedUrl": "https://tailscale.com/security-bulletins/index.xml",
      "siteUrl": "https://tailscale.com/security-bulletins/",
      "articles": []
    },
    {
      "title": "Airbnb API Status - Incident History",
      "feedUrl": "https://airbnbapi.statuspage.io/history.rss",
      "siteUrl": "https://airbnbapi.statuspage.io",
      "articles": [
        {
          "id": "https://airbnbapi.statuspage.io/incidents/6c9mb4kd3fy7",
          "author": null,
          "description": "Aug 10, 15:27 PDT\nResolved - This incident has been resolved.\nAug 10, 05:08 PDT\nInvestigating - We are currently investigating an issue that prevents partners from creating Support Tickets. For critical issues that require escalation, kindly contact your Airbnb Connectivity Partner Manager. \nPlease see ticket priority guidelines - https://developer.airbnb.com/docs/create-and-manage-support-cases#ticket-priority\nOur engineering teams are working to get everything up and running again, and we will update you with the latest information as soon as possible.",
          "link": "https://airbnbapi.statuspage.io/incidents/6c9mb4kd3fy7",
          "publishedOn": "2023-08-10T22:27:41.000Z",
          "wordCount": 3409,
          "title": "Support tickets submission issue",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/9ydjrhv3dwh2",
          "author": null,
          "description": "Jul 28, 11:28 PDT\nResolved - [False alarm] This incident was a false alarm—the LOS Records API is working as expected. Apologies for the inconvenience.\nJul 28, 10:02 PDT\nIdentified - Starting today (July 28, 2023), we identified an issue affecting the LOS Records API. Records for 180 days from today (beyond Jan 24, 2024) are being ignored, and the dates are marked as unavailable on Airbnb, although requests to set those records are not failing. We are actively working to find the root cause, and mitigate this issue. We will post more information as soon as possible.",
          "link": "https://airbnbapi.statuspage.io/incidents/9ydjrhv3dwh2",
          "publishedOn": "2023-07-28T18:28:33.000Z",
          "wordCount": 3436,
          "title": "Incident Affecting LOS Records API",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/fg9fy7k4mhk4",
          "author": null,
          "description": "Jul 27, 12:13 PDT\nResolved - We have resolved this incident.\nJul 27, 00:02 PDT\nMonitoring - There has been an increase in confirmed reservation notifications not including guest details in full since 2023-07-24.\nThe issue worsened significantly earlier today on 2023-07-27.\nThe root cause has been identified and a fix has been implemented.\nWe are monitoring the situation.\nWe recommend to retrieve the details with GET reservations requests.\nApologies for the inconvenience caused.",
          "link": "https://airbnbapi.statuspage.io/incidents/fg9fy7k4mhk4",
          "publishedOn": "2023-07-27T19:13:44.000Z",
          "wordCount": 3413,
          "title": "Issues Affecting Guest Details in Reservation Webhooks",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/ysvh24l8l9w1",
          "author": null,
          "description": "Jul 25, 13:03 PDT\nResolved - We resolved the incident. Please retry any request that failed during the incident, and don't hesitate to contact us if you need support.\nJul 25, 11:50 PDT\nMonitoring - We have deployed a fix for this issue around 11:00 AM (PDT), and are monitoring the results.\nJul 25, 09:49 PDT\nInvestigating - We are actively investigating an increased number of 500 errors on the PUT Pricing Settings endpoint. These errors started today (July 25, 2023) around 05:00 AM (PDT). Our engineering teams are working to get everything up and running again, and we will update you with the latest information as soon as possible.",
          "link": "https://airbnbapi.statuspage.io/incidents/ysvh24l8l9w1",
          "publishedOn": "2023-07-25T20:03:48.000Z",
          "wordCount": 3456,
          "title": "500 Error on PUT Pricing Settings API",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/qj19z52zmnqj",
          "author": null,
          "description": "Jul 24, 15:37 PDT\nResolved - We resolved the incident around 03:00 PM (PDT). Please retry any request that failed during the incident, and don't hesitate to contact us if you need support.\nJul 24, 14:16 PDT\nInvestigating - We are actively investigating an increased number of 500 errors across multiple endpoints, as well as timeout errors on the Partner Portal. These errors started today (July 24, 2023) around 02:00 PM PDT. Our engineering teams are working to get everything up and running again, and we will update you with the latest information as soon as possible.",
          "link": "https://airbnbapi.statuspage.io/incidents/qj19z52zmnqj",
          "publishedOn": "2023-07-24T22:37:04.000Z",
          "wordCount": 3444,
          "title": "500 Error Across Multiple Endpoints and Support Tools",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/l6f622b5k1t3",
          "author": null,
          "description": "Jul 13, 09:22 PDT\nResolved - We have backfilled message threads for the reservations that were affected during this time window. You should now be able to retrieve the `thread_id` associated with a reservation using the Reservations API. Apologies for the inconvenience.\nIf you have any further queries related to this incident, please submit a ticket via the Partner Support Portal and our team will get back to you as soon as possible.\nJul 12, 12:25 PDT\nIdentified - We have identified an issue that caused reservations to be created without associated threads. This occurred between 10:15 PM and 11:29 PM on July 12th (PST), so notifications for reservations created during that time were sent with a null `thread_id` value.\nWe are actively working on creating threads for reservations that do not have them, and will update here afterwards.\nOnce this is done, you will be able to retrieve the `thread_id` value for a reservation using the Reservations API.",
          "link": "https://airbnbapi.statuspage.io/incidents/l6f622b5k1t3",
          "publishedOn": "2023-07-13T16:22:18.000Z",
          "wordCount": 3494,
          "title": "Reservations Missing Thread Id Values",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Twilio Status - Incident History",
      "feedUrl": "https://status.twilio.com/history.rss",
      "siteUrl": "https://status.twilio.com",
      "articles": [
        {
          "id": "https://status.twilio.com/incidents/dvb38x0tdx8b",
          "author": null,
          "description": "Aug 10, 17:00 PDT\nCompleted - The scheduled maintenance has been completed.\nAug 10, 13:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug  9, 08:24 PDT\nScheduled - The Megafon network in Russia is conducting a planned maintenance from 10 August 2023 at 13:00 PDT until 10 August 2023 at 17:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to Megafon Russia handsets.",
          "link": "https://status.twilio.com/incidents/dvb38x0tdx8b",
          "publishedOn": "2023-08-11T00:00:51.000Z",
          "wordCount": 6470,
          "title": "Russia SMS Carrier Maintenance - Megafon",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/sqr3w1sshb5f",
          "author": null,
          "description": "Aug 10, 16:56 PDT\nMonitoring - We are observing recovery in SMS delivery delays when sending messages to Beeline Network In Kazakhstan. We will continue monitoring the service to ensure a full recovery. We will provide another update in 30 minutes or as soon as more information becomes available.\nAug 10, 15:27 PDT\nUpdate - We are experiencing SMS delivery delays when sending messages to Beeline Network In Kazakhstan. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 14:33 PDT\nInvestigating - We are experiencing SMS delivery delays when sending messages to Beeline Network In Kazakhstan. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/sqr3w1sshb5f",
          "publishedOn": "2023-08-10T23:56:07.000Z",
          "wordCount": 6546,
          "title": "SMS Delivery Delays to Beeline Network In Kazakhstan",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/vz94rvhx517f",
          "author": null,
          "description": "Aug 10, 16:40 PDT\nUpdate - We are continuing to experience an issue with Conversations API as media security is not being correctly applied. Our engineers are working to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 15:47 PDT\nUpdate - We are experiencing an issue with Conversations API as media security is not being correctly applied. Our engineers are working to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.\nAug 10, 15:36 PDT\nInvestigating - Our monitoring systems have detected a potential issue with Conversations API. Our engineering team has been alerted and is actively investigating. We will update as soon as we have more information.",
          "link": "https://status.twilio.com/incidents/vz94rvhx517f",
          "publishedOn": "2023-08-10T23:40:44.000Z",
          "wordCount": 6538,
          "title": "On Call Engineers Are Investigating an Issue With Conversations API",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/46ndn20fy3hw",
          "author": null,
          "description": "Aug 10, 16:38 PDT\nUpdate - We are continuing to experience SMS delivery delays when sending messages to Movistar network in Mexico. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 16:11 PDT\nMonitoring - We continue experiencing SMS delivery delays when sending messages to Movistar network in Mexico. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 30 minutes or as soon as more information becomes available.\nAug 10, 13:59 PDT\nUpdate - We are experiencing SMS delivery delays when sending messages to Movistar network in Mexico. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 4 hours or as soon as more information becomes available.\nAug 10, 12:08 PDT\nUpdate - We are experiencing SMS delivery delays when sending messages to Movistar network in Mexico. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 11:24 PDT\nInvestigating - We are experiencing SMS delivery delays when sending messages to Movistar network in Mexico. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/46ndn20fy3hw",
          "publishedOn": "2023-08-10T23:38:59.000Z",
          "wordCount": 6650,
          "title": "SMS Delivery Delays To Movistar Network In Mexico",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/02b1t7tdc1r7",
          "author": null,
          "description": "Aug 10, 16:32 PDT\nResolved - We are no longer experiencing SMS delivery failures to Orange network in Sierra Leone. This incident has been resolved.\nAug 10, 14:37 PDT\nUpdate - We are observing successful SMS delivery to Orange network in Sierra Leone.  We will continue to monitor to ensure full service recovery. We expect to provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 14:05 PDT\nMonitoring - We are observing successful SMS delivery to Orange network in Sierra Leone.  We will continue to monitor to ensure full service recovery. We expect to provide another update in 30 mins or as soon as more information becomes available.\nAug 10, 10:51 PDT\nUpdate - We continue to experience SMS delivery failures to Orange network in Sierra Leone. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 8 hours or as soon as more information becomes available.\nAug 10, 06:51 PDT\nUpdate - We continue to experience SMS delivery failures to Orange network in Sierra Leone. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 4 hours or as soon as more information becomes available.\nAug 10, 04:51 PDT\nUpdate - We continue to experience SMS delivery failures to Orange network in Sierra Leone. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 03:56 PDT\nInvestigating - We are experiencing SMS delivery failures to Orange network in Sierra Leone. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/02b1t7tdc1r7",
          "publishedOn": "2023-08-10T23:32:27.000Z",
          "wordCount": 6718,
          "title": "SMS Delivery Failures to Orange Network in Sierra Leone",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/6gwt0s9l89dl",
          "author": null,
          "description": "Aug 10, 14:35 PDT\nResolved - We are no longer experiencing SMS delivery delays when sending messages to Glo Network in Nigeria. This incident has been resolved.\nAug 10, 12:33 PDT\nUpdate - We are observing recovery in SMS delivery delays when sending messages to Glo network in Nigeria. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 12:13 PDT\nMonitoring - We are observing recovery in SMS delivery delays when sending messages to Glo network in Nigeria. We will continue monitoring the service to ensure a full recovery. We will provide another update in 30 minutes or as soon as more information becomes available.\nAug  9, 20:36 PDT\nUpdate - We are still experiencing outbound SM…",
          "link": "https://status.twilio.com/incidents/6gwt0s9l89dl",
          "publishedOn": "2023-08-10T21:35:47.000Z",
          "wordCount": 6788,
          "title": "Outbound SMS Delivery Delays to Glo Network in Nigeria",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/9ckk70xcnyg2",
          "author": null,
          "description": "Aug 10, 12:01 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug 10, 05:34 PDT\nScheduled - The Ufone network in Pakistan is conducting a emergency maintenance from 10 August 2023 at 12:00 PDT until 10 August 2023 at 18:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to Ufone Pakistan handsets.",
          "link": "https://status.twilio.com/incidents/9ckk70xcnyg2",
          "publishedOn": "2023-08-10T19:01:25.000Z",
          "wordCount": 6460,
          "title": "Pakistan SMS Carrier Maintenance - Ufone",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/pcshg4mnb3sx",
          "author": null,
          "description": "Aug 10, 10:46 PDT\nResolved - We are no longer experiencing SMS delivery delays when sending messages to Orange Network in Egypt. This incident has been resolved.\nAug 10, 08:54 PDT\nMonitoring - We are observing recovery in delivery report delays when sending messages to Orange Network in Egypt. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 08:34 PDT\nUpdate - We continue to experience SMS delivery delays when sending messages to Orange Network in Egypt. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 07:34 PDT\nInvestigating - We are experiencing SMS delivery delays when sending messages to Orange Network in Egypt. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/pcshg4mnb3sx",
          "publishedOn": "2023-08-10T17:46:29.000Z",
          "wordCount": 6577,
          "title": "SMS Delivery Delays to Orange Network in Egypt",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/6k2q5cgrxzvq",
          "author": null,
          "description": "Aug 10, 10:31 PDT\nResolved - We are continuing to experience MMS intermittent delivery delays to AT&T network in the US via subset of short codes. However, we’re resolving this incident posts since the impact was limited to a set of customers, who have been contacted individually to address any concerns. All systems are operational.\nAug 10, 10:02 PDT\nInvestigating - We are experiencing MMS delivery delays to AT&T network in US via subset of shortcode. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/6k2q5cgrxzvq",
          "publishedOn": "2023-08-10T17:31:58.000Z",
          "wordCount": 6515,
          "title": "MMS Delivery Delays To AT&T Network In US Via Subset Of Shortcode",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/833sycs7jnmt",
          "author": null,
          "description": "Aug 10, 06:06 PDT\nResolved - We are no longer experiencing SMS delivery delays when sending messages to Orange Network In French Guiana. This incident has been resolved.\nAug 10, 04:10 PDT\nMonitoring - We are observing recovery in SMS delivery delays when sending messages to Orange network In French Guiana. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nAug  9, 21:09 PDT\nUpdate - We continue to experience SMS delivery delays when sending messages to Orange network in French Guiana. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 24 hours or as soon as more information becomes available.\nAug  9, 05:22 PDT\nUpdate - We contin…",
          "link": "https://status.twilio.com/incidents/833sycs7jnmt",
          "publishedOn": "2023-08-10T13:06:23.000Z",
          "wordCount": 6788,
          "title": "SMS Delivery Delays to Orange Network In French Guiana",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/27z87fb0drb7",
          "author": null,
          "description": "Aug 10, 05:06 PDT\nResolved - We are no longer experiencing SMS delivery delays and failures when sending messages to Smart network in Philippines. This incident has been resolved.\nAug 10, 03:17 PDT\nMonitoring - We are observing recovery in SMS delivery delays and failures when sending messages to Smart network in Philippines. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 01:59 PDT\nUpdate - We are experiencing SMS delivery delays and failures when sending messages to Smart network in Philippines. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug 10, 01:01 PDT\nInvestigating - We are experiencing SMS delivery delays and failures when sending messages to Smart network in Philippines. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/27z87fb0drb7",
          "publishedOn": "2023-08-10T12:06:33.000Z",
          "wordCount": 6586,
          "title": "SMS Delivery Delays and Failures to Smart Network in Philippines",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/8fl9t1r6p0p3",
          "author": null,
          "description": "Aug 10, 05:01 PDT\nCompleted - The scheduled maintenance has been completed.\nAug  9, 23:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug  9, 15:26 PDT\nScheduled - The AT&T network in Mexico is conducting a planned maintenance from 09 August  2023 at 23:00 PDT until 10 August 2023 at 05:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from AT&T Mexico handsets.",
          "link": "https://status.twilio.com/incidents/8fl9t1r6p0p3",
          "publishedOn": "2023-08-10T12:01:07.000Z",
          "wordCount": 6477,
          "title": "Mexico SMS Carrier Maintenance - AT&T",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/h6j6n9m2gm89",
          "author": null,
          "description": "Aug 10, 04:42 PDT\nResolved - We are no longer experiencing SMS delivery delays when sending messages to XL Axiata and SmartFren Telecom networks in Indonesia. This incident has been resolved.\nAug 10, 02:47 PDT\nMonitoring - We are observing recovery in SMS delivery delays when sending messages to XL Axiata and SmartFren Telecom networks in Indonesia. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nAug  9, 22:56 PDT\nUpdate - We are experiencing SMS delivery delays when sending messages to XL Axiata and SmartFren Telecom networks in Indonesia. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 4 hours or as soon as more information becomes available.\nAug  9, 21:12 PDT\nUpdate - We are experiencing SMS delivery delays when sending messages to XL Axiata and SmartFren Telecom networks in Indonesia. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 2 hours or as soon as more information becomes available.\nAug  9, 20:31 PDT\nInvestigating - We are experiencing SMS delivery delays when sending messages to XL Axiata and SmartFren Telecom networks in Indonesia. Our engineers are working with our carrier partner to resolve the issue. We will provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/h6j6n9m2gm89",
          "publishedOn": "2023-08-10T11:42:19.000Z",
          "wordCount": 6654,
          "title": "SMS Delivery Delays to XL Axiata and SmartFren Telecom Networks in Indonesia",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/9tj4zdlxzrn3",
          "author": null,
          "description": "Aug 10, 00:33 PDT\nResolved - We are no longer experiencing issues with a subset of customers unable to comment on tickets they opened. This incident has been resolved.\nAug  7, 17:38 PDT\nUpdate - We are no longer experiencing issues with a subset of customers unable to comment on tickets they opened. This incident has been resolved.\nAug  7, 14:00 PDT\nUpdate - We continue to experience a problem with a subset of customers unable to comment on tickets they opened. We expect to provide another update in 4 hours or as soon as more information becomes available.\nAug  7, 12:10 PDT\nUpdate - We continue to experience a problem with a subset of customers unable to comment on tickets they opened. We expect to provide another update in 2 hours or as soon as more information becomes available.\nAug  7, 11:22 PDT\nInvestigating - We are investigating a problem with a subset of customers unable to comment on tickets they opened. We expect to provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/9tj4zdlxzrn3",
          "publishedOn": "2023-08-10T07:33:47.000Z",
          "wordCount": 6592,
          "title": "A Subset of Customers Experiencing Problems to Comment on Tickets Opened",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/dmdgv1qj3qbp",
          "author": null,
          "description": "Aug  9, 23:00 PDT\nCompleted - The scheduled maintenance has been completed.\nAug  9, 21:30 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug  8, 07:23 PDT\nScheduled - The US Cellular network in the US is conducting a planned maintenance from 09 August 2023 at 21:30 PDT until 09 August 2023 at 23:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from US Cellular US handsets.",
          "link": "https://status.twilio.com/incidents/dmdgv1qj3qbp",
          "publishedOn": "2023-08-10T06:00:21.000Z",
          "wordCount": 6481,
          "title": "US SMS Carrier Maintenance - US Cellular",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "DigitalOcean Status - Incident History",
      "feedUrl": "https://status.digitalocean.com/history.rss",
      "siteUrl": "http://status.digitalocean.com",
      "articles": [
        {
          "id": "https://status.digitalocean.com/incidents/xh9qhhhvcl77",
          "author": null,
          "description": "Aug 10, 23:24 UTC\nCompleted - The scheduled maintenance has been completed.\nAug 10, 20:00 UTC\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug  6, 14:39 UTC\nScheduled - Start: 2023-08-10 20:00 UTC\nEnd:  2023-08-11 00:00 UTC\nDuring the above window, our Networking team will be making changes to our core networking infrastructure to improve performance and scalability in the SGP1 region. \nExpected impact:\nThese upgrades are designed and tested to be seamless and we do not expect any impact to customer traffic due to this maintenance. If an unexpected issue arises, affected Droplets and Droplet-based services may experience a temporary loss of private connectivity between VPCs. We will endeavor to keep any such impact to a minimum.\nIf you have any questions related to this issue please send us a ticket from your cloud support page. https://cloudsupport.digitalocean.com/s/createticket",
          "link": "https://status.digitalocean.com/incidents/xh9qhhhvcl77",
          "publishedOn": "2023-08-10T23:24:53.000Z",
          "wordCount": 5272,
          "title": "SGP1 Network Maintenance - Phase 2",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/k65k44vxwr9j",
          "author": null,
          "description": "Aug  9, 22:46 UTC\nCompleted - The scheduled maintenance has been completed.\nAug  9, 20:01 UTC\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nAug  6, 14:36 UTC\nScheduled - Start: 2023-08-09 20:00 UTC\nEnd:  2023-08-10 00:00 UTC\nDuring the above window, our Networking team will be making changes to our core networking infrastructure to improve performance and scalability in the SGP1 region. This maintenance will occur in two parts on consecutive days and we will send another maintenance notice for the second phase.\nExpected impact:\nThese upgrades are designed and tested to be seamless and we do not expect any impact to customer traffic due to this maintenance. If an unexpected issue arises, affected Droplets and Droplet-based services may experience a temporary loss of private connectivity between VPCs. We will endeavor to keep any such impact to a minimum.\nIf you have any questions related to this issue please send us a ticket from your cloud support page. https://cloudsupport.digitalocean.com/s/createticket",
          "link": "https://status.digitalocean.com/incidents/k65k44vxwr9j",
          "publishedOn": "2023-08-09T22:46:01.000Z",
          "wordCount": 5292,
          "title": "SGP1 Network Maintenance - Phase 1",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/q4b09b022nmh",
          "author": null,
          "description": "Aug  9, 16:01 UTC\nResolved - Our Engineering team has confirmed full resolution of the issue impacting network connectivity in multiple regions. The impact has been completely subsided and the network connectivity is back to normal for all the impacted services. Users should now be able to process events normally for Droplets and Droplet-based services like Load Balancers, Kubernetes or Database clusters, etc.\nIf you continue to experience problems, please open a ticket with our support team from your Cloud Control Panel.\nThank you for your patience and we apologize for any inconvenience.\nAug  9, 14:58 UTC\nMonitoring - The rollout of the fix to redundant networking equipment is fully completed, meaning all networking devices in AMS3, LON1, and SFO2 have been patched. Our Engineering team s…",
          "link": "https://status.digitalocean.com/incidents/q4b09b022nmh",
          "publishedOn": "2023-08-09T16:01:48.000Z",
          "wordCount": 5998,
          "title": "Networking in Multiple Regions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/szklqql7y77c",
          "author": null,
          "description": "Jul 27, 03:20 UTC\nCompleted - The scheduled maintenance has been completed.\nJul 27, 01:02 UTC\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nJul 26, 23:08 UTC\nScheduled - Start: 2023-07-27 01:00 UTC\nEnd: 2023-07-27 05:00 UTC\n\nDuring the above window, our Networking team will be making changes to our core networking infrastructure to improve performance and scalability in the SFO3 region. This will be the second of the two maintenance activities performed by our team in the region on consecutive days.\nExpected Impact:\nThese upgrades are designed and tested to be seamless and we do not expect any impact to customer traffic due to this maintenance. If an unexpected issue arises, affected Droplets and Droplet-based services may experience a temporary loss of private connectivity between VPCs. We will endeavour to keep any such impact to a minimum.\nIf you have any questions or concerns regarding this maintenance, please reach out to us by opening up a ticket on your account via https://cloudsupport.digitalocean.com/s/createticket.",
          "link": "https://status.digitalocean.com/incidents/szklqql7y77c",
          "publishedOn": "2023-07-27T03:20:54.000Z",
          "wordCount": 5296,
          "title": "SFO3 Network Maintenance Phase 2",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/d750rzt8dtgw",
          "author": null,
          "description": "Jul 26, 03:45 UTC\nCompleted - The scheduled maintenance has been completed.\nJul 26, 01:00 UTC\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nJul 25, 23:09 UTC\nScheduled - Start: 2023-07-26 01:00 UTC\nEnd: 2023-07-26 05:00 UTC\nDuring the above window, our Networking team will be making changes to our core networking infrastructure to improve performance and scalability in the SFO3 region. This maintenance will occur in two parts on consecutive days and we will send another maintenance notice for the second phase. \nExpected Impact:\nThese upgrades are designed and tested to be seamless and we do not expect any impact to customer traffic due to this maintenance. If an unexpected issue arises, affected Droplets and Droplet-based services may experience a temporary loss of private connectivity between VPCs. We will endeavor to keep any such impact to a minimum.\nIf you have any questions or concerns regarding this maintenance, please reach out to us by opening up a ticket on your account via https://cloudsupport.digitalocean.com/s/createticket.",
          "link": "https://status.digitalocean.com/incidents/d750rzt8dtgw",
          "publishedOn": "2023-07-26T03:45:04.000Z",
          "wordCount": 5292,
          "title": "SFO3 Network Maintenance",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/hwy11pmr6hgl",
          "author": null,
          "description": "Jul 20, 22:31 UTC\nResolved - As of 21:52 UTC, our Engineering team has confirmed the full resolution of the issue impacting the creation of directories/folders/files in Spaces buckets via the Cloud Control Panel. \nIf you continue to experience problems, please open a ticket with our Support team. Thank you for your patience and we apologize for the inconvenience.\nJul 20, 22:05 UTC\nMonitoring - As of 21:32 UTC, our Engineering team has implemented a fix for the issue impacting the creation of directories/folders/files in Spaces buckets in the Cloud Control Panel.\nWe're now monitoring the situation closely. We will post an update as soon as the issue is fully resolved.\nJul 20, 21:39 UTC\nUpdate - Our Engineering team is investigating an issue with creating directories/folders/files in Spaces buckets using the Cloud Control Panel.\nDuring this time, users should still be able to create the Spaces Bucket using Control Panel and API.\nWe will share an update as soon as possible.\nJul 20, 21:38 UTC\nInvestigating - Our Engineering team is investigating an issue with creating directories/folders/files in Spaces buckets using the Cloud Control Panel.\nDuring this time, users should still be able to create the Spaces Bucket using Control Panel and API.\nWe will share an update as soon as possible.",
          "link": "https://status.digitalocean.com/incidents/hwy11pmr6hgl",
          "publishedOn": "2023-07-20T22:31:03.000Z",
          "wordCount": 5334,
          "title": "Spaces directories creation",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/04y93nmb1blj",
          "author": null,
          "description": "Jul 14, 15:25 UTC\nResolved - From 14:53 - 15:26 UTC, we experienced an issue with Kubernetes clusters and our Kubernetes API. During that time, users would have experienced errors while communicating with their clusters , as well as seen errors while sending requests to API endpoints. Errors to the API manifested as 404's on /v2/kubernetes/clusters endpoints. \nOur Engineering team was able to take swift action to roll back a breaking change, remediating the incident. \nWe apologize for the disruption in service. If you are still experiencing any problems or have additional questions, then please open a support ticket within your account.",
          "link": "https://status.digitalocean.com/incidents/04y93nmb1blj",
          "publishedOn": "2023-07-14T15:25:24.000Z",
          "wordCount": 5209,
          "title": "Kubernetes Clusters",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.digitalocean.com/incidents/k6db523qf5gw",
          "author": null,
          "description": "Jul 13, 02:33 UTC\nResolved - Our engineering team has resolved the issue with the Billing page for Team accounts in the Cloud Control Panel. \nThank you for your patience. If you continue to experience any problems, please open a support ticket from within your account.\nJul 13, 01:33 UTC\nMonitoring - As of 01:20 UTC, Our Engineering team has implemented a fix regarding the issue with the Billing page for Team accounts in the Cloud Control Panel. We are monitoring the situation to ensure there is no recurrence. \nWe will post another update once we confirm the issue is fully resolved.\nJul 13, 01:27 UTC\nInvestigating - As of 01:05 UTC, Our Engineering team is investigating an issue with the Billing page for Teams on the Cloud Control Panel. During this time, users on Team accounts may experience errors while accessing the Billing page. \nWe apologize for the inconvenience and will share an update once we have more information.",
          "link": "https://status.digitalocean.com/incidents/k6db523qf5gw",
          "publishedOn": "2023-07-13T02:33:27.000Z",
          "wordCount": 5291,
          "title": "Billing page on the Cloud Panel",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Notion Status - Incident History",
      "feedUrl": "https://status.notion.so/history.rss",
      "siteUrl": "https://status.notion.so",
      "articles": [
        {
          "id": "https://status.notion.so/incidents/56mkzzfczbws",
          "author": null,
          "description": "Aug  1, 10:10 PDT\nResolved - This incident has been resolved.\nAug  1, 10:10 PDT\nInvestigating - Between 7/26 and 8/1, Notion experienced an issue which prevented users from receiving push notifications on mobile devices. The issue was resolved today, at approximately 9:45 am PDT.",
          "link": "https://status.notion.so/incidents/56mkzzfczbws",
          "publishedOn": "2023-08-01T17:10:44.000Z",
          "wordCount": 2906,
          "title": "Mobile Push Notifications",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/jxbwzkjpwvph",
          "author": null,
          "description": "Jul 26, 17:22 PDT\nResolved - This incident is resolved for all customers.\nJul 26, 12:39 PDT\nInvestigating - We are currently investigating an issue with relations experiencing degraded performance",
          "link": "https://status.notion.so/incidents/jxbwzkjpwvph",
          "publishedOn": "2023-07-27T00:22:18.000Z",
          "wordCount": 2891,
          "title": "Relations degraded performance",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/ps6b5r9s5sfk",
          "author": null,
          "description": "Jul 20, 16:05 PDT\nResolved - This incident has been resolved.\nJul 20, 15:30 PDT\nMonitoring - We published a fix and validating the problem is fixed\nJul 20, 14:46 PDT\nIdentified - A change to request cookie consent is preventing users from accessing Notion. We have identified the issue and are working on a fix.",
          "link": "https://status.notion.so/incidents/ps6b5r9s5sfk",
          "publishedOn": "2023-07-20T23:05:12.000Z",
          "wordCount": 2949,
          "title": "Some users prevented from accessing Notion due to change in request cookie consent",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/g2ywgyryp910",
          "author": null,
          "description": "Jul 20, 15:07 PDT\nResolved - This incident has been resolved.\nJul 20, 14:57 PDT\nInvestigating - Users are unable to export workspace and page files. We are currently investigating the issue",
          "link": "https://status.notion.so/incidents/g2ywgyryp910",
          "publishedOn": "2023-07-20T22:07:47.000Z",
          "wordCount": 2914,
          "title": "Users cannot access any exported files from pages or workspaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Rippling Status - Incident History",
      "feedUrl": "https://status.rippling.com/history.rss",
      "siteUrl": "https://status.rippling.com",
      "articles": [
        {
          "id": "https://status.rippling.com/incidents/s4g3w61q9lsr",
          "author": null,
          "description": "Aug  7, 17:35 UTC\nResolved - This incident has been resolved. Site performance should be back to normal.\nAug  7, 16:26 UTC\nMonitoring - We've stopped a data migration job that is believed to be contributing, and we're now seeing site latency return back to baseline numbers. The site latency should now be back to normal, but we are continuing to monitor.\nAug  7, 16:01 UTC\nInvestigating - There is degraded performance across the Rippling application, with certain pages loading slowly. We are investigating the issue.",
          "link": "https://status.rippling.com/incidents/s4g3w61q9lsr",
          "publishedOn": "2023-08-07T17:35:47.000Z",
          "wordCount": 4262,
          "title": "Increased site latency",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/dg5nlq85bkk3",
          "author": null,
          "description": "Jul 28, 15:44 UTC\nResolved - The incident is now resolved\nJul 28, 15:15 UTC\nMonitoring - The third party provider has resumed service. We are closely monitoring the status of all outgoing emails\nJul 28, 15:01 UTC\nInvestigating - Our third-party email delivery provider has been experiencing an intermittent outage since Jul 28th, 7:45 AM PST, causing a delay in notification delivery for all Rippling emails (including password resets). We are investigating this issue with the third-party provider.",
          "link": "https://status.rippling.com/incidents/dg5nlq85bkk3",
          "publishedOn": "2023-07-28T15:44:02.000Z",
          "wordCount": 4270,
          "title": "Delay in email delivery due to third-party outage",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/5b7jz0d5pc9s",
          "author": null,
          "description": "Jul 27, 15:51 UTC\nResolved - This incident has been resolved.\nJul 27, 15:30 UTC\nUpdate - A fix has been implemented and product functionality has been restored.\nJul 27, 14:58 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nJul 27, 14:52 UTC\nUpdate - Users are reporting missing values on the payroll tab in the employee profile. This will be fixed momentarily. This does not impact any processing of payroll.\nJul 27, 14:20 UTC\nMonitoring - A fix has been implemented and we are monitoring the results.\nJul 27, 14:18 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nJul 27, 14:13 UTC\nInvestigating - Users are reporting issues with signing in to apps that they use Rippling as the identity provider. Our recommended workaround is to sign in to Rippling first and then navigate to the app using the SSO navigation bar. We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/5b7jz0d5pc9s",
          "publishedOn": "2023-07-27T15:51:21.000Z",
          "wordCount": 4365,
          "title": "Issues with the employee profile payroll tab",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/nxj258xcyfmh",
          "author": null,
          "description": "Jul 13, 20:31 UTC\nResolved - This incident has been resolved.\nJul 13, 18:45 UTC\nMonitoring - A fix has been implemented and we are monitoring the results.\nJul 13, 18:31 UTC\nIdentified - Select customers have received an email with subject \"Domain Verification failed\". This email was sent erroneously and isn't applicable to any customer who has received it, and it can be ignored.",
          "link": "https://status.rippling.com/incidents/nxj258xcyfmh",
          "publishedOn": "2023-07-13T20:31:10.000Z",
          "wordCount": 4256,
          "title": "Email sent erroneously regarding work email domain verification",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        }
      ]
    },
    {
      "title": "Google Workspace Status Dashboard Updates",
      "feedUrl": "https://www.google.com/appsstatus/dashboard/en/feed.atom",
      "siteUrl": "https://www.google.com/appsstatus/dashboard/",
      "articles": [
        {
          "id": "https://www.google.com/appsstatus/dashboard/incidents/nukLGccNGE22LWLXw5Tu",
          "author": null,
          "description": "<p> Incident began at <strong>2023-07-24 14:50</strong> and ended at <strong>2023-07-26 11:15</strong> <span>(times are in <strong>Coordinated Universal Time (UTC)</strong>).</span></p><div class=\"cBIRi14aVDP__status-update-text\"><h1>Incident Report</h1>\n<h2>Summary</h2>\n<p>On 24 July 2023 at 07:50, following a Google Classroom iOS app update,  the app would not load properly if users attempted to access any course page that had attached materials for a duration of 1 day, 20 hours, 25 minutes. During the disruption, users were able to access course pages by uninstalling and reinstalling the Classroom iOS app.</p>\n<h2>Root Cause</h2>\n<p>The root cause has been identified as a bug, triggered by an update released for Classroom iOS, that caused an issue with the local database migration. This caused the iOS app to not load properly when users attempted to access course pages with attached materials, as the migration was specific to the materials configuration.</p>\n<h2>Remediation and Prevention</h2>\n<p>Google engineers were alerted to the issue via internal monitoring on 24 July 2023 at 07:50 US/Pacific and immediately started an investigation. Google engineers reproduced the issue,  identified the trigger as a failed database migration, and paused the auto update. This prevented any further disruption. An app update with a fix was released for the Classroom iOS app, thereby resolving the issue on 26 July 2023 at 04:15 US/Pacific. Users who had already updated to the problematic app version were advised to either uninstall and reinstall or update the app to the version with the fix.</p>\n<p>Google is committed to preventing recurrence by implementing the following action items:</p>\n<ul>\n<li>Implement additional pre-release migration and application testing plans to validate app stability</li>\n</ul>\n</div><hr><p>Affected products: Classroom</p>",
          "link": "https://www.google.com/appsstatus/dashboard/incidents/nukLGccNGE22LWLXw5Tu",
          "publishedOn": "2023-08-02T20:08:21.000Z",
          "wordCount": 948,
          "title": "RESOLVED: We're investigating reports of an issue with Classroom. We will provide more information shortly.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "GitHub Status - Incident History",
      "feedUrl": "https://www.githubstatus.com/history.rss",
      "siteUrl": "https://www.githubstatus.com",
      "articles": [
        {
          "id": "https://www.githubstatus.com/incidents/rk1918knvr0w",
          "author": null,
          "description": "Aug 10, 21:20 UTC\nResolved - This incident has been resolved.\nAug 10, 21:07 UTC\nUpdate - Webhooks delivery latency has recovered, and we will continue to monitor.\nAug 10, 20:56 UTC\nUpdate - Actions is operating normally.\nAug 10, 20:21 UTC\nUpdate - We have applied mitigations and are seeing improvements in webhooks delivery latency. We continue to monitor for full recovery. We are also working to mitigate unrelated issues with Actions.\nAug 10, 19:47 UTC\nUpdate - Actions is experiencing degraded performance. We are continuing to investigate.\nAug 10, 19:33 UTC\nUpdate - We are still working to resolve high webhooks delivery latency.\nAug 10, 18:54 UTC\nUpdate - We are still seeing high latency in webhook delivery and are actively working to resolve the issue.\nAug 10, 18:12 UTC\nUpdate - Webhooks deliveries are experiencing high latency. We are actively investigating and working to mitigate.\nAug 10, 17:35 UTC\nInvestigating - We are investigating reports of degraded performance for Webhooks",
          "link": "https://www.githubstatus.com/incidents/rk1918knvr0w",
          "publishedOn": "2023-08-10T21:20:23.000Z",
          "wordCount": 4365,
          "title": "Incident with Webhooks and Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/nwb8m3ppfxw6",
          "author": null,
          "description": "Aug  9, 20:14 UTC\nResolved - This incident has been resolved.\nAug  9, 20:02 UTC\nUpdate - Git Operations is operating normally.\nAug  9, 19:54 UTC\nUpdate - Actions is experiencing degraded performance. We are continuing to investigate.\nAug  9, 19:42 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations",
          "link": "https://www.githubstatus.com/incidents/nwb8m3ppfxw6",
          "publishedOn": "2023-08-09T20:14:05.000Z",
          "wordCount": 4250,
          "title": "Incident with Git Operations and Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/s9scz41r9wkx",
          "author": null,
          "description": "Aug  1, 20:28 UTC\nResolved - This incident has been resolved.\nAug  1, 20:12 UTC\nInvestigating - We are investigating reports of degraded performance for Copilot",
          "link": "https://www.githubstatus.com/incidents/s9scz41r9wkx",
          "publishedOn": "2023-08-01T20:28:01.000Z",
          "wordCount": 4206,
          "title": "Incident with Copilot",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/l59z35rhzdky",
          "author": null,
          "description": "Jul 28, 15:45 UTC\nResolved - This incident has been resolved.\nJul 28, 15:38 UTC\nUpdate - We are actively mitigating delays in commits showing on pull requests.\nJul 28, 15:13 UTC\nUpdate - We are investigating an issue which is causing a delay in the time it takes new commits to show up on a pull request.\nJul 28, 14:51 UTC\nUpdate - We are investigating an issue which is causing a delay in the time it takes new commits to show up on a pull request.\nJul 28, 14:49 UTC\nInvestigating - We are investigating reports of degraded performance for Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/l59z35rhzdky",
          "publishedOn": "2023-07-28T15:45:36.000Z",
          "wordCount": 4294,
          "title": "Incident with Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/9f8dkxjg67qq",
          "author": null,
          "description": "Jul 28, 10:00 UTC\nResolved - This incident has been resolved.\nJul 28, 09:31 UTC\nInvestigating - We are investigating reports of degraded performance for Issues.",
          "link": "https://www.githubstatus.com/incidents/9f8dkxjg67qq",
          "publishedOn": "2023-07-28T10:00:49.000Z",
          "wordCount": 4206,
          "title": "Incident with Issues",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/xfmyxxhcknvj",
          "author": null,
          "description": "Jul 28, 01:08 UTC\nResolved - This incident has been resolved.\nJul 28, 00:50 UTC\nUpdate - We have identified a problem causing an issue with Pull Requests for some users. We are working on a mitigation.\nJul 28, 00:07 UTC\nUpdate - We have identified a problem causing an issue with Pull Requests for some users. We are working on a mitigation.\nJul 27, 23:35 UTC\nUpdate - We have identified a problem causing an issue with Pull Requests for some users. We are working on a mitigation.\nJul 27, 22:56 UTC\nUpdate - We are still investigating an issue with Pull Requests. We will continue to keep users updated on progress towards mitigation.\nJul 27, 22:18 UTC\nUpdate - We found an issue with repos that affects ability of some of the customers to merge pull requests. We are working on mitigation.\nJul 27, 22:04 UTC\nInvestigating - We are investigating reports of degraded performance for Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/xfmyxxhcknvj",
          "publishedOn": "2023-07-28T01:08:39.000Z",
          "wordCount": 4354,
          "title": "Incident with Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/mbvjmqbcb1xk",
          "author": null,
          "description": "Jul 26, 15:04 UTC\nResolved - This incident has been resolved.\nJul 26, 14:09 UTC\nUpdate - For a small subset of customers some pull requests may not show up as mergeable. We are investigating the cause of the issue and will post an update as we have more information.\nJul 26, 13:50 UTC\nInvestigating - We are investigating reports of degraded performance for Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/mbvjmqbcb1xk",
          "publishedOn": "2023-07-26T15:04:05.000Z",
          "wordCount": 4252,
          "title": "Incident with Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/98fs1552d2nw",
          "author": null,
          "description": "Jul 25, 22:43 UTC\nResolved - This incident has been resolved.\nJul 25, 22:33 UTC\nUpdate - We found an issue that impacts a small subset of customers Jul 25, 22:33 UTC\nInvestigating - We are currently investigating this issue.",
          "link": "https://www.githubstatus.com/incidents/98fs1552d2nw",
          "publishedOn": "2023-07-25T22:43:47.000Z",
          "wordCount": 4248,
          "title": "Investigating reports of degraded performance.",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/6503rcn8s34s",
          "author": null,
          "description": "Jul 21, 14:01 UTC\nResolved - This incident has been resolved.\nJul 21, 14:01 UTC\nUpdate - Actions is operating normally.\nJul 21, 14:01 UTC\nUpdate - Packages is operating normally.\nJul 21, 14:01 UTC\nUpdate - API Requests is operating normally.\nJul 21, 14:01 UTC\nUpdate - Git Operations is operating normally.\nJul 21, 14:01 UTC\nUpdate - Pages is operating normally.\nJul 21, 14:00 UTC\nUpdate - Networking issues are fully mitigated and service operation is restored. We will continue to work on follow ups internally but all services are operating normally.\nJul 21, 13:45 UTC\nUpdate - We have mitigated the network power issue and are watching services recover. We will continue to monitor recovery and return status to green when the issue is fully mitigated.\nJul 21, 13:36 UTC\nUpdate - API Requests is experiencing degraded performance. We are continuing to investigate.\nJul 21, 13:34 UTC\nUpdate - We are experiencing a power failure at a datacenter related to our networking infrastructure that is impacting a subset of customers using our services. We are working on mitigating the issue.\nJul 21, 13:27 UTC\nUpdate - Pull Requests is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nJul 21, 13:22 UTC\nUpdate - Pages is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nJul 21, 13:21 UTC\nUpdate - Packages is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nJul 21, 13:15 UTC\nUpdate - Actions is experiencing degraded performance. We are continuing to investigate.\nJul 21, 13:12 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations.",
          "link": "https://www.githubstatus.com/incidents/6503rcn8s34s",
          "publishedOn": "2023-07-21T14:01:48.000Z",
          "wordCount": 4530,
          "title": "Incident with Actions, API Requests, Git Operations, Packages, Pages and Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/shbq71s0g00z",
          "author": null,
          "description": "Jul 18, 16:44 UTC\nResolved - This incident has been resolved.\nJul 18, 16:43 UTC\nUpdate - Pull Requests is operating normally.\nJul 18, 16:34 UTC\nUpdate - We have mitigated the issue causing slow git operations for some customers and operations should now be performing normally.\nJul 18, 16:05 UTC\nUpdate - Some customers may be experiencing slow git operations. We have identified the cause of the issue and are working on a mitigation.\nJul 18, 15:51 UTC\nUpdate - Pull Requests is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nJul 18, 15:44 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations.",
          "link": "https://www.githubstatus.com/incidents/shbq71s0g00z",
          "publishedOn": "2023-07-18T16:44:11.000Z",
          "wordCount": 4320,
          "title": "Incident with Git Operations and Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/x4llkxfv8kn4",
          "author": null,
          "description": "Jul 12, 18:08 UTC\nResolved - This incident has been resolved.\nJul 12, 17:59 UTC\nUpdate - We have identified a problematic configuration change that caused Codespaces creations and resumes to fail. The change has been reverted and users should start seeing improvements soon.\nJul 12, 17:38 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/x4llkxfv8kn4",
          "publishedOn": "2023-07-12T18:08:00.000Z",
          "wordCount": 4241,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        }
      ]
    },
    {
      "title": "Slack System Status",
      "feedUrl": "https://status.slack.com/feed/rss",
      "siteUrl": "https://status.slack.com/",
      "articles": [
        {
          "id": "https://status.slack.com//2023-08/c68673e38899ac38",
          "author": null,
          "description": "Issue Summary:\n\r\nOn August 9, 2023 from 9:00 AM PDT to August 10th 2023, 8:00 AM PDT, some Enterprise Grid users experienced a failure to redirect from browser to app during login - focus was moved to the app, but the sign in process did not complete.\n\r\n\r\nWe made a change to some logging functions and introduced a fix that mitigated the issue. This fix is permanent and will keep this issue from happening again.",
          "link": "https://status.slack.com//2023-08/c68673e38899ac38",
          "publishedOn": "2023-08-10T21:28:27.000Z",
          "wordCount": 308,
          "title": "Incident: Trouble signing into the desktop app for some Enterprise Grid customers",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-08/5f97959abbaeeaa1",
          "author": null,
          "description": "Issue Summary:\n\r\n\r\nOn August 7, 2023, customers may have experienced issues with loading images, creating canvases, and workflow modals being delayed. A small number of customers may have been impacted as early as 5:50 AM PDT, with larger impact seen between 7:03AM PDT to 7:14AM PDT.\n\r\n\r\nWe traced the issue to a change that caused our server infrastructure to be overloaded. We rolled back this change, resolving the issue for all impacted users.",
          "link": "https://status.slack.com//2023-08/5f97959abbaeeaa1",
          "publishedOn": "2023-08-07T17:39:42.000Z",
          "wordCount": 173,
          "title": "Incident: Users may be experiencing issues uploading images and creating canvases.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-08/8fd09ebe40c64df0",
          "author": null,
          "description": "We’ve restored full functionality to file uploads for all impacted users. You may need to reload Slack (Command/Ctrl + Shift + R) in order for this fix to be reflected on your end. We’re sorry for the disruption we brought to your day.",
          "link": "https://status.slack.com//2023-08/8fd09ebe40c64df0",
          "publishedOn": "2023-08-04T19:19:51.000Z",
          "wordCount": 215,
          "title": "Incident: Some users may be experiencing issues uploading files.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-08/8ec13e4962a9bf43",
          "author": null,
          "description": "Issue summary:\n\r\nOn August 2, 2023 from 9:01 AM PDT to 11:00 AM PDT, customers may have experienced issues with blurry images in Slack, as well as trouble uploading files. A small percentage of customers may have also experienced errors or slowness when loading channels, sending messages, accessing admin pages, and connecting to Slack.\n\r\n\r\nAn issue with a routine database cluster migration inadvertently caused a decrease in capacity. Unfortunately, this coincided with a scheduled job to process a large number of custom status requests, an activity that commonly occurs at the top of each hour. The number of incoming requests exceeded the unintentionally reduced capacity of the database cluster, leading to errors and sluggishness for some actions in Slack. As these requests piled up, other Slack services began to experience issues as well, including a small number of users being unable to connect.\n\r\n\r\nWe paused the scheduled custom status job to immediately mitigate the load on the affected database cluster. This resolved some of the errors affecting Slack services. Once we established we had sufficient capacity to handle the scheduled job, we resumed processing the custom status requests, fully restoring normal service for all affected users.\n\r\n\r\nOnce the load was balanced and custom status processing had returned to normal, we deployed a fix to correct the issue with the database cluster migration, bringing capacity back to the expected level.",
          "link": "https://status.slack.com//2023-08/8ec13e4962a9bf43",
          "publishedOn": "2023-08-03T02:32:16.000Z",
          "wordCount": 579,
          "title": "Incident: Users may be experiencing issues connecting to Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/4a00e5109815910b",
          "author": null,
          "description": "Issue Summary:\n\r\n\r\nFrom July 26th, 2023 at 8:00AM PDT to July 28th 2023 at 1:00PM PDT some users had trouble loading and editing canvases when accessing them from the channel canvas icon.\n\r\n\r\nWe determined this issue was caused by a recent code change related to how canvases persist across sessions. We issued a code update which resolved the issue for all impacted users. To see the fix applied, user impacted users should press Command/Control + R. We are also working on deploying a subsequent code update intended to prevent the issue from reoccurring in the future.",
          "link": "https://status.slack.com//2023-07/4a00e5109815910b",
          "publishedOn": "2023-07-28T23:12:31.000Z",
          "wordCount": 227,
          "title": "Incident: Channel canvases not loading correctly.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/08e3781ccbef33d5",
          "author": null,
          "description": "Issue summary: \n\r\n\r\nOn July 27, 2023 between 2:03 AM PDT - 2:59 AM PDT, Slack was experiencing a systemwide issue during which users were not able to send or receive messages across multiple platforms. \n\r\n\r\nOur engineering team identified an issue after a change was made to a service that manages our internal system communication. This resulted in degradation of Slack functionality until the change was reverted which resolved the issue for all users. \n\r\n\r\nWe are currently hard at work on scoping measures to prevent this from happening in the future. More information about remediation and prevention steps will be included in an upcoming RCA which you can request by writing into feedback@slack.com.",
          "link": "https://status.slack.com//2023-07/08e3781ccbef33d5",
          "publishedOn": "2023-07-27T14:32:50.000Z",
          "wordCount": 284,
          "title": "Outage: Slack Systemwide Issues",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/1633ff35517d83b8",
          "author": null,
          "description": "Issue summary:\n\r\nOn July 25th, 2023 from 3:00 PM PDT to 6:00 PM PDT we received reports of existing members unable to invite new members to workspaces. We traced the cause of issue to a recent code change which prevented emails from being sent. This also impacted logins, workspace creation and potentially other email-based processes. We’ve reverted this change, and the issue was resolved for all customers.",
          "link": "https://status.slack.com//2023-07/1633ff35517d83b8",
          "publishedOn": "2023-07-26T06:46:27.000Z",
          "wordCount": 269,
          "title": "Incident: Email service is failing across Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/87cc7f492c7c074a",
          "author": null,
          "description": "Issue Summary:\n\r\nFrom 2:46 PM PDT to 6:44 PM PDT on July 21, 2023, some users were unable to unarchive channels to which they belonged.\n\r\nWe determined that a recent code change caused this issue. We reverted the code change and the issue was resolved.",
          "link": "https://status.slack.com//2023-07/87cc7f492c7c074a",
          "publishedOn": "2023-07-24T22:19:41.000Z",
          "wordCount": 185,
          "title": "Incident: Option to unarchive private channels is missing",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/6f8189e691513b85",
          "author": null,
          "description": "Users should no longer be experiencing any trouble searching threads. Apologies for the trouble today and thank you for your patience.",
          "link": "https://status.slack.com//2023-07/6f8189e691513b85",
          "publishedOn": "2023-07-24T18:30:57.000Z",
          "wordCount": 90,
          "title": "Incident: Thread search results may be returning as blank for users.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/fd848c4da89c73cd",
          "author": null,
          "description": "Users should no longer be experiencing any trouble loading threads or sending messages. Apologies for the trouble today and thank you for your patience.",
          "link": "https://status.slack.com//2023-07/fd848c4da89c73cd",
          "publishedOn": "2023-07-24T18:06:49.000Z",
          "wordCount": 103,
          "title": "Incident: Users may be experiencing issues loading threads and sending messages.",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/ca6b134d9fd2d5a4",
          "author": null,
          "description": "We’ve identified the cause of this issue. Any users encountering a REB9FC2A4F43 error can reload Slack (Command/Ctrl + Shift + R) in order to resolve this error. Thank you for your patience while we sorted out this issue.",
          "link": "https://status.slack.com//2023-07/ca6b134d9fd2d5a4",
          "publishedOn": "2023-07-21T16:12:39.000Z",
          "wordCount": 142,
          "title": "Incident: Some user unable to load profiles",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-07/c77cf2eeb9a222df",
          "author": null,
          "description": "Issue Summary:\n\r\nOn July 13, 2023 between 12:19 PM PDT and 12:36 PM PDT, some users encountered errors which led to being unable to load threads, send DMs, joining channels, and accessing Slack overall.\n\r\n\r\nThis issue was a result of a failed host in our database infrastructure. We quickly replaced this host, fixing the problem for all impacted users.\n\r\n\r\nUsers should no longer be experiencing any trouble accessing Slack.",
          "link": "https://status.slack.com//2023-07/c77cf2eeb9a222df",
          "publishedOn": "2023-07-13T21:25:19.000Z",
          "wordCount": 101,
          "title": "Incident: Trouble with loading threads and accessing Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        }
      ]
    },
    {
      "title": "Make Status - Incident History",
      "feedUrl": "https://status.make.com/history.rss",
      "siteUrl": "https://status.make.com",
      "articles": [
        {
          "id": "https://status.make.com/incidents/b17vq1m1ztj4",
          "author": null,
          "description": "Jul 23, 16:00 CEST\nResolved - Executions of scheduled scenarios in the EU1 zone are delayed.",
          "link": "https://status.make.com/incidents/b17vq1m1ztj4",
          "publishedOn": "2023-07-23T14:00:00.000Z",
          "wordCount": 3352,
          "title": "Delayed scenario executions in the EU1 zone",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.make.com/incidents/lpshgnkxkz7n",
          "author": null,
          "description": "Jul 14, 06:49 CEST\nResolved - This incident was resolved by hotfix.\nJul 13, 15:39 CEST\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.make.com/incidents/lpshgnkxkz7n",
          "publishedOn": "2023-07-14T04:49:33.000Z",
          "wordCount": 3389,
          "title": "Issues with Facebook Lead Ads - New Event instant trigger",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.make.com/incidents/ym8fpgs8rb0j",
          "author": null,
          "description": "Jul 13, 18:08 CEST\nResolved - This incident has been resolved.\nJul 13, 15:45 CEST\nMonitoring - We have applied the fix to reactivate the affected scenarios. \nPlease note that this reactivation will not be visible in the scenario logs.\nCurrently the platfrom is fully operational but we will continue to monitor situation for the next couple of hours.\nJul 13, 13:11 CEST\nIdentified - The issue has been identified and we are currently working on implementing the fix to reactivate the affected scenarios.\nWe'll post the next update once the fix is rolled out.\nJul 13, 12:10 CEST\nUpdate - We have identified the cause of the issue. Any newly executed scenarios and scheduled scenarios should work correctly. However, as part of the investigation we noticed the issue affected other zones: us1.make.com and eu2.make.com. \nWe are currently working on reactivating the affected scenarios.\nJul 13, 11:22 CEST\nInvestigating - We are facing issues with scenario execution affecting users on eu1.make.com. Scenarios might unexpectedly fail, users might receive notification about scenarios being stopped, We are currently investigating the cause of the issue, we will provide more details within the next hour.",
          "link": "https://status.make.com/incidents/ym8fpgs8rb0j",
          "publishedOn": "2023-07-13T16:08:31.000Z",
          "wordCount": 3531,
          "title": "Issues with executing scenarios",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}