{
  "sources": [
    {
      "title": "BookingSync.com news",
      "feedUrl": "https://changelog.bookingsync.com/rss",
      "siteUrl": "https://changelog.bookingsync.com",
      "articles": [
        {
          "id": "262029",
          "author": "Yannick, Customer Care Team Leader - Pro Team",
          "description": "Action required\n  \nFollowing our recent messages concerning the changes needed for your website domains, we would like to inform you that we have extended the support for the previous configuration until April 10 2023.\nIf you have not made the needeed changes yet, please consult our manual article here.\nIf you need assistance doing the changes, please contact our support team and we will be happy to assist you with the modifications. Please make sure to have access to your registrar (Gandi, OVH, Godaddy…) so we can assist you in performing this change.\nThanks,",
          "link": "https://changelog.bookingsync.com/reminder-important-information-regarding-your-website-domain!-262029",
          "publishedOn": "2023-04-06T07:36:35.000Z",
          "wordCount": 330,
          "title": "Reminder - Important information regarding your website domain!",
          "imageUrl": null
        },
        {
          "id": "260094",
          "author": "Yannick, Customer Care Team Leader - Pro Team",
          "description": "Action required\n  \nAs we are doing some improvements on our infrastructure, we have some modifications that are necessary on the way some of your website domains are configured.\nTo ensure that you have the best configuration, we invite you to review the settings on your registrar to make sure that you have the correct configuration.\nWhat is needed?\nYour main domain should be under a **Cname **record with **www **and point to dns1.happystay.com. (the \"dot\" at the end may be required depending on your domain).\n(example for your main domain: www.yourwebsite.com)\nYou can also add an addon domain without using www if you want your website to be reachable this way, (example: yourwebsite.com).\nIn order to do that, you can configure an A record (Aname) in your DNS zone pointing to one of the following IP addresses:\n13.248.140.34\n\n\n76.223.14.214\n\n\nThese are the new addresses that are replacing the previous address: (52.210.201.133)\nImportant note, If you are using 52.210.201.133, you need to change to one of the new IP address as we will not be able to keep supporting this one on March 29th 2023.\nIf you need assistance doing this change, please contact our support team and we will be happy to assist you with the modifications. Please make sure to have access to your registrar (Gandi, OVH, Godaddy…) so we can assist you in performing this change. \nThe details are also available on our manual.\nThanks,",
          "link": "https://changelog.bookingsync.com/follow-up-important-information-regarding-your-website-domain!-260094",
          "publishedOn": "2023-03-15T08:17:43.000Z",
          "wordCount": 475,
          "title": "Follow up - Important information regarding your website domain!",
          "imageUrl": null
        },
        {
          "id": "259586",
          "author": "Yannick, Customer Care Team Leader - Pro Team",
          "description": "Communications\n  \nWe will be doing some improvements on our website infrastructure which may temporarily affect your websites.\nThe maintenance will take place on tuesday March 14, 2023 at 06:00am CET and will have a duration of 3 hours max.\nWhat will be the impact?\n· Websites may not be unreachable for up to 10 minutes at maintenance time.\n· SSL may be unavailable from the beginning of the maintenance for up to 3 hours (website will still be reachable without https)\nDo I need to do anything?\nThis maintenance will impact the DNS zone we are using to link your website to our infrastructure, therefore some changes will be required in the 2 weeks following this update if you are using your own domain name with A records.\nWe will send a second communication with the information and update our manual to help you with this transition.\nOf course our support team will be there to assist you.\nThank you for your comprehension,",
          "link": "https://changelog.bookingsync.com/important-information-regarding-your-website-domain!-259586",
          "publishedOn": "2023-03-09T12:25:23.000Z",
          "wordCount": 395,
          "title": "Important information regarding your website domain!",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Security Bulletins on Tailscale",
      "feedUrl": "https://tailscale.com/security-bulletins/index.xml",
      "siteUrl": "https://tailscale.com/security-bulletins/",
      "articles": [
        {
          "id": "https://tailscale.com/security-bulletins/#ts-2023-004/",
          "author": null,
          "description": "Description: An issue in the Tailscale coordination server allowed tailnets created by GitHub organizations which were subsequently renamed to be associated with a new GitHub organization with the previous name.\nWhat happened?\nTailscale mapped tailnets created by GitHub organizations to their organization name, rather than to their organization ID. This meant that if a GitHub organization was renamed, and the previous name taken over by a new GitHub organization, the existing tailnet would be tied to the new GitHub organization instead of the original one.\nWho is affected?\nUp to 1,305 tailnets created by GitHub organizations may have been affected, if those GitHub organizations were renamed between 2021-06-18 and 2023-03-30 and fully relinquished the old GitHub organization name. Additiona…",
          "link": "https://tailscale.com/security-bulletins/#ts-2023-004/",
          "publishedOn": "2023-04-04T00:00:00.000Z",
          "wordCount": 3187,
          "title": "TS-2023-004",
          "imageUrl": "https://tailscale.com/files/images/og-image.png"
        },
        {
          "id": "https://tailscale.com/security-bulletins/#ts-2023-003/",
          "author": null,
          "description": "Reference: CVE-2023-28436\nSeverity: Medium\nCVSS vector string: CVSS:3.0/AV:A/AC:L/PR:H/UI:R/S:C/C:H/I:N/A:N\nDescription: A vulnerability identified in the implementation of Tailscale SSH in FreeBSD allowed commands to be run with a higher privilege group ID than that specified by Tailscale SSH access rules.\nAffected platforms: FreeBSD\nPatched Tailscale client versions: v1.38.2 or later\nWhat happened?\nA difference in the behavior of the FreeBSD setgroups system call from POSIX meant that the Tailscale client running on a FreeBSD-based operating system did not appropriately restrict groups on the host when using Tailscale SSH. When accessing a FreeBSD host over Tailscale SSH, the egid of the tailscaled process was used instead of that of the user specified in Tailscale SSH access rules.\nWho is affected?\n9 tailnets with 22 FreeBSD nodes running Tailscale SSH since Tailscale v1.34 (released on 2022-12-04) may have had Tailscale SSH sessions with a higher privilege group ID than that specified in Tailscale SSH access rules.\nWe have notified affected organizations where we have security contacts.\nWhat is the impact?\nTailscale SSH commands may have been run with a higher privilege group ID than that specified in Tailscale SSH access rules if they met all of the following criteria:\nThe destination node was a FreeBSD device with Tailscale SSH enabled;\nTailscale SSH access rules permitted access for non-root users; and\nA non-interactive SSH session was used.\nWhat do I need to do?\nIf you are running Tailscale on FreeBSD, upgrade to v1.38.2 or later to remediate the issue. Admins of a tailnet can view FreeBSD nodes with unpatched versions in the admin console.\nTo update the local ports tree in advance of what’s available upstream, you can:\ncd /usr/ports/security/tailscale\nedit the Makefile to set PORTVERSION to 1.38.2\nmake makesum\nmake install\nTailscale SSH on other platforms is not affected.\nCredits\nWe would like to thank Ryan Belgrave for reporting this issue.",
          "link": "https://tailscale.com/security-bulletins/#ts-2023-003/",
          "publishedOn": "2023-03-22T00:00:00.000Z",
          "wordCount": 3187,
          "title": "TS-2023-003",
          "imageUrl": "https://tailscale.com/files/images/og-image.png"
        }
      ]
    },
    {
      "title": "Airbnb API Status - Incident History",
      "feedUrl": "https://airbnbapi.statuspage.io/history.rss",
      "siteUrl": "https://airbnbapi.statuspage.io",
      "articles": [
        {
          "id": "https://airbnbapi.statuspage.io/incidents/3v91lr711bpb",
          "author": null,
          "description": "Apr  5, 02:01 PDT\nResolved - We have identified and resolved an internal issue that resulted in 403 and 404 errors across multiple API endpoints. The incident was active between April 4th 20:00 PDT and April 5th 00:00 PDT. You can retry any failed requests at this point, and if you keep experiencing issues, please contact the API integration team for additional help.\nWe apologize for the inconvenience caused.\nApr  5, 00:51 PDT\nMonitoring - A fix has been implemented and we are monitoring the results.\nApr  4, 23:15 PDT\nIdentified - The issue has been identified and a fix is being implemented.\nApr  4, 21:57 PDT\nInvestigating - We are currently investigating an issue related to 403 and 404 Errors across multiple endpoints. We'll post updates as we have more information.",
          "link": "https://airbnbapi.statuspage.io/incidents/3v91lr711bpb",
          "publishedOn": "2023-04-05T09:01:07.000Z",
          "wordCount": 3338,
          "title": "403 and 404 Errors Across Multiple Endpoints",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/g18hcjbzzsfk",
          "author": null,
          "description": "Apr  5, 01:46 PDT\nCompleted - The scheduled maintenance has been completed.\nJul  5, 13:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nJun 30, 10:55 PDT\nScheduled - As announced on July 5, 2021 we are deprecating our XML API connection.\nXML listings can no longer be activated: this means that new XML listings will remain unlisted even if you set \ntrue\n. The same is valid for existing listing that are deactivated (i.e. you will not be able to reactivate a XML listing if it gets unlisted).\nMore information about this enforcement here: https://developer.airbnb.com/docs/enforcement",
          "link": "https://airbnbapi.statuspage.io/incidents/g18hcjbzzsfk",
          "publishedOn": "2023-04-05T08:46:06.000Z",
          "wordCount": 3295,
          "title": "XML Migration Enforcement",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/flsz0qg3ysj6",
          "author": null,
          "description": "Apr  4, 19:03 PDT\nResolved - We have identified and resolved an internal issue that resulted in 500 errors across multiple API endpoints. The incident was active between 17:30 and 19:00 PDT on April 4th. You can retry any failed requests at this point, and if you keep experiencing issues, please contact the API integration team for additional help.\nWe apologize for the inconvenience.\nApr  4, 18:30 PDT\nMonitoring - A fix has been implemented and we are monitoring the results.\nApr  4, 18:06 PDT\nInvestigating - We are currently investigating an issue related to 500 errors across multiple endpoints. We'll post updates as we have more information.",
          "link": "https://airbnbapi.statuspage.io/incidents/flsz0qg3ysj6",
          "publishedOn": "2023-04-05T02:03:23.000Z",
          "wordCount": 3306,
          "title": "500 Errors Across Multiple Endpoints",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/s6nclwbgvrb3",
          "author": null,
          "description": "Apr  3, 22:24 PDT\nResolved - We have identified and resolved an internal issue that resulted in 500 errors across multiple API endpoints, especially calendar operations, reservations and price quote endpoints. The incident was active between 17:00 and 20:10 PDT on April 3rd. You can retry any failed requests at this point, and if you keep experiencing issues, please contact the API integration team for additional help.\nWe apologize for the inconvenience.\nApr  3, 21:58 PDT\nMonitoring - A fix has been implemented and we are monitoring the results.\nApr  3, 20:25 PDT\nIdentified - The issue has been identified and we are working on a fix.\nApr  3, 17:58 PDT\nUpdate - The issue is now impacting more endpoints including calendar operations and rate plan, we'll post updates as we have more information.\nApr  3, 17:45 PDT\nInvestigating - We are currently investigating an issue related to 500 errors on price quote API and reservation APIs. We'll post updates as we have more information.",
          "link": "https://airbnbapi.statuspage.io/incidents/s6nclwbgvrb3",
          "publishedOn": "2023-04-04T05:24:55.000Z",
          "wordCount": 3376,
          "title": "500 Errors on Price Quote and Reservation Endpoints",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://airbnbapi.statuspage.io/incidents/k6xc09dvz8r5",
          "author": null,
          "description": "Mar 27, 15:42 PDT\nResolved - We have identified and resolved an internal issue that resulted in reservation webhook notifications being sent with $0 price. The incident was active between 13:40 and 14:20 PDT. Reservations payments were processed correctly, but nightly prices and fees appeared as $0 within the webhooks. Please use the GET Reservations API to retrieve the correct reservations prices. Alternatively, please contact the API Integrations team for additional help.\nApologies for the inconvenience.",
          "link": "https://airbnbapi.statuspage.io/incidents/k6xc09dvz8r5",
          "publishedOn": "2023-03-27T22:42:56.000Z",
          "wordCount": 3270,
          "title": "Reservation webhooks with $0 price",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Twilio Status - Incident History",
      "feedUrl": "https://status.twilio.com/history.rss",
      "siteUrl": "https://status.twilio.com",
      "articles": [
        {
          "id": "https://status.twilio.com/incidents/c34hn344k362",
          "author": null,
          "description": "THIS IS A SCHEDULED EVENT Apr 6, 20:00 PDT  -  Apr 7, 04:00 PDT\nMar 31, 15:27 PDT\nScheduled - The AT&T network in US is conducting an emergency maintenance from 06 April 2023 at 20:00 PDT until 07 April 2023 at 04:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from AT&T US handsets.",
          "link": "https://status.twilio.com/incidents/c34hn344k362",
          "publishedOn": "2023-04-07T03:00:00.000Z",
          "wordCount": 6195,
          "title": "US SMS Carrier Maintenance - AT&T",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/51vlmtxgypzm",
          "author": null,
          "description": "Apr  6, 17:01 PDT\nCompleted - The scheduled maintenance has been completed.\nApr  6, 14:01 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nApr  4, 13:51 PDT\nScheduled - The Beeline network in Russia is conducting a planned maintenance from 06 April 2023 at 14:00 PDT until 06 April 2023 at 17:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from Beeline Russia handsets.",
          "link": "https://status.twilio.com/incidents/51vlmtxgypzm",
          "publishedOn": "2023-04-07T00:01:17.000Z",
          "wordCount": 6208,
          "title": "Russia SMS Carrier Maintenance - Beeline",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/x3hbx90vmjr8",
          "author": null,
          "description": "Apr  6, 17:00 PDT\nCompleted - The scheduled maintenance has been completed.\nApr  6, 13:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nApr  3, 09:20 PDT\nScheduled - The Megafon network in Russian Federation is conducting an emergency maintenance from 06 April 2023 at 13:00 PDT until 06 April 2023 at 17:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from Megafon handsets.",
          "link": "https://status.twilio.com/incidents/x3hbx90vmjr8",
          "publishedOn": "2023-04-07T00:00:09.000Z",
          "wordCount": 6211,
          "title": "Russia SMS Carrier Maintenance - Megafon",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/xqj9pbwf5110",
          "author": null,
          "description": "Apr  6, 15:02 PDT\nResolved - Twilio Programmable Video was degraded for 5 minutes between 4/6 4:37 pm and 4:42 pm Pacific Time. During this period of time customers may have experienced failed requests on video compositions. The issue has now been resolved.",
          "link": "https://status.twilio.com/incidents/xqj9pbwf5110",
          "publishedOn": "2023-04-06T22:02:37.000Z",
          "wordCount": 6151,
          "title": "Programmable Video Affected",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/lh2hygzqrwsn",
          "author": null,
          "description": "Apr  6, 05:53 PDT\nResolved - We are no longer experiencing SMS delivery delays when sending messages to Africell Network in Democratic Republic of the Congo and Sierra Leone. This incident has been resolved.\nApr  6, 04:17 PDT\nMonitoring - We are observing recovery in SMS delivery delays when sending messages to Africell Network in Democratic Republic of the Congo and Sierra Leone. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nApr  6, 03:41 PDT\nUpdate - We are still experiencing SMS delivery delay when sending messages to Africell Network in Democratic Republic of the Congo and Sierra Leone. Our engineers are working with our carrier partner to resolve the issue. We will provide …",
          "link": "https://status.twilio.com/incidents/lh2hygzqrwsn",
          "publishedOn": "2023-04-06T12:53:22.000Z",
          "wordCount": 6648,
          "title": "SMS Delivery Delay to Africell Network in Democratic Republic of the Congo and Sierra Leone",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/8xngn926ngb0",
          "author": null,
          "description": "Apr  6, 04:00 PDT\nCompleted - The scheduled maintenance has been completed.\nApr  5, 20:00 PDT\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nMar 29, 13:11 PDT\nScheduled - The AT&T network in US is conducting an emergency maintenance from 05 April 2023 at 20:00 PDT until 06 April 2023 at 04:00 PDT. During the maintenance window, there could be intermittent delays delivering SMS to and from AT&T US handsets.",
          "link": "https://status.twilio.com/incidents/8xngn926ngb0",
          "publishedOn": "2023-04-06T11:00:20.000Z",
          "wordCount": 6220,
          "title": "US SMS Carrier Maintenance - AT&T",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/bv05l0gbgb9q",
          "author": null,
          "description": "Apr  6, 03:46 PDT\nResolved - We are no longer experiencing delivery report delays for Multiple Networks in US from Subset of Twilio Short Codes. This incident has been resolved.\nApr  6, 02:01 PDT\nMonitoring - We are observing recovery in delivery report delays for Multiple Networks in US from Subset of Twilio Short Codes. We will continue monitoring the service to ensure a full recovery. We will provide another update in 2 hours or as soon as more information becomes available.\nApr  6, 01:14 PDT\nInvestigating - We are experiencing delays in receiving message delivery reports for Multiple Networks in US from Subset of Twilio Short Codes. Our engineers are working with our carrier partner to resolve the issue. We expect to provide another update in 1 hour or as soon as more information becomes available.",
          "link": "https://status.twilio.com/incidents/bv05l0gbgb9q",
          "publishedOn": "2023-04-06T10:46:30.000Z",
          "wordCount": 6298,
          "title": "Delay in Receiving Delivery Report for Multiple Networks US From Subset of Short Code",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.twilio.com/incidents/8n9xh36qr22y",
          "author": null,
          "description": "Apr  6, 03:30 PDT\nResolved - We observed SMS Delivery Failure and Delay to Bouygues Telecom and Free Mobile France Networks for 46 minutes between 02:21 and 03:07 Pacific Time on 04/06/2023. During this period of time customers may have experienced SMS Delivery Failure and Delay to the affected Networks. The issue has now been resolved.",
          "link": "https://status.twilio.com/incidents/8n9xh36qr22y",
          "publishedOn": "2023-04-06T10:30:00.000Z",
          "wordCount": 6194,
          "title": "SMS Delivery Failure and Delay to Bouygues Telecom and Free Mobile France Networks",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Notion Status - Incident History",
      "feedUrl": "https://status.notion.so/history.rss",
      "siteUrl": "https://status.notion.so",
      "articles": [
        {
          "id": "https://status.notion.so/incidents/1zx7mzp3m9qh",
          "author": null,
          "description": "Mar 31, 09:29 PDT\nResolved - This incident has been resolved.\nMar 31, 08:55 PDT\nMonitoring - A fix has been implemented and we are monitoring results.\nMar 31, 08:49 PDT\nUpdate - We are continuing to investigate this issue.\nMar 31, 08:49 PDT\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.notion.so/incidents/1zx7mzp3m9qh",
          "publishedOn": "2023-03-31T16:29:51.000Z",
          "wordCount": 2779,
          "title": "Degradation of database performance",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/5wgctrsfk12z",
          "author": null,
          "description": "Mar 27, 08:53 PDT\nResolved - We have confirmed this issue has been resolved, and Notion should load normally for all users.\nMar 27, 08:42 PDT\nMonitoring - We have implemented a fix that has restored normal loading times for most users, and are continuing to monitor.\nMar 27, 07:40 PDT\nInvestigating - Notion is loading slowly or not at all for some users. We are investigating.",
          "link": "https://status.notion.so/incidents/5wgctrsfk12z",
          "publishedOn": "2023-03-27T15:53:19.000Z",
          "wordCount": 2789,
          "title": "High latency",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/rk7qmfsdj1kb",
          "author": null,
          "description": "Mar 17, 13:36 PDT\nResolved - This issue has been resolved. Users should be able to successfully load Notion pages now.\nMar 17, 12:13 PDT\nUpdate - We are continuing to work on mitigation and resolution for slow loading times.\nMar 17, 10:52 PDT\nIdentified - Some users are experiencing slow load times. We have identified the root cause and are working on resolving it.",
          "link": "https://status.notion.so/incidents/rk7qmfsdj1kb",
          "publishedOn": "2023-03-17T20:36:09.000Z",
          "wordCount": 2787,
          "title": "Performance degradation",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/zyddfgt7nfmw",
          "author": null,
          "description": "Mar 12, 09:08 PDT\nResolved - Engineering has implemented a fix. Notification issue has been resolved.\nMar 12, 09:07 PDT\nUpdate - We are continuing to investigate this issue.\nMar 12, 08:07 PDT\nInvestigating - We are currently experiencing an issue with notifications. Engineering is investigating the root cause of this issue.",
          "link": "https://status.notion.so/incidents/zyddfgt7nfmw",
          "publishedOn": "2023-03-12T16:08:37.000Z",
          "wordCount": 2777,
          "title": "Notifications are not working",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.notion.so/incidents/pxth0clm33h4",
          "author": null,
          "description": "Mar 11, 15:55 PST\nCompleted - The scheduled maintenance has been completed.\nMar 11, 15:35 PST\nIn progress - Scheduled maintenance is currently in progress. We will provide updates as necessary.\nMar 11, 15:34 PST\nScheduled - We are currently undergoing scheduled maintenance. Notifications may be unavailable between 3:30 - 3:40pm Pacific time. Notifications received during that time will be sent when the maintenance is complete.",
          "link": "https://status.notion.so/incidents/pxth0clm33h4",
          "publishedOn": "2023-03-11T23:55:15.000Z",
          "wordCount": 2790,
          "title": "Database upgrade",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    },
    {
      "title": "Rippling Status - Incident History",
      "feedUrl": "https://status.rippling.com/history.rss",
      "siteUrl": "https://status.rippling.com",
      "articles": [
        {
          "id": "https://status.rippling.com/incidents/n1h5yd5mmfc9",
          "author": null,
          "description": "Apr  3, 17:46 UTC\nResolved - This incident has been resolved.\nApr  3, 16:57 UTC\nIdentified - The issue has been identified and a fix is being implemented.",
          "link": "https://status.rippling.com/incidents/n1h5yd5mmfc9",
          "publishedOn": "2023-04-03T17:46:15.000Z",
          "wordCount": 3984,
          "title": "Issues loading Devices page",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/yhm54z3b1wqg",
          "author": null,
          "description": "Mar 13, 06:18 UTC\nResolved - This incident has been resolved.\nMar 13, 06:18 UTC\nUpdate - We are continuing to work on a fix for this issue.\nMar 10, 23:13 UTC\nUpdate - All payments with a check date of March 10th have been successfully submitted. Some have been completed, and others will complete between Saturday, March 11th and Monday, March 13th.\nThis morning, Rippling was assured by SVB that all payments would be processed today. However, when SVB fell into receivership with the FDIC, we immediately began working with JPMorgan Chase to find an alternative means to send funds to employees. \nAs a result of the actions we took, all employees will receive their payments between today and Monday morning, depending on which bank they use. Rippling has extended our own capital to fund these pay…",
          "link": "https://status.rippling.com/incidents/yhm54z3b1wqg",
          "publishedOn": "2023-03-13T06:18:38.000Z",
          "wordCount": 4478,
          "title": "Banking partner delay",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/k4qyh9s92rw1",
          "author": null,
          "description": "Mar 10, 23:50 UTC\nResolved - This incident has been resolved.\nMar 10, 19:13 UTC\nUpdate - A fix has been deployed, recovery efforts are underway.  ETA for resolution is today.\nMar  9, 23:05 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nMar  9, 18:10 UTC\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/k4qyh9s92rw1",
          "publishedOn": "2023-03-10T23:50:52.000Z",
          "wordCount": 4053,
          "title": "Device actions are slow and the Rippling Admin account may temporarily be out of sync",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/grbrkfxrz4m1",
          "author": null,
          "description": "Mar  9, 21:48 UTC\nResolved - This incident has been resolved.\nMar  9, 19:40 UTC\nUpdate - We are continuing to monitor for any further issues.\nMar  9, 19:22 UTC\nMonitoring - We've identified a root cause for the issue and have resolved page loading issues. We are continuing to monitor for any further issues.\nMar  9, 18:40 UTC\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.rippling.com/incidents/grbrkfxrz4m1",
          "publishedOn": "2023-03-09T21:48:19.000Z",
          "wordCount": 4020,
          "title": "Issues loading Rippling",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/y9wybwpbgtfd",
          "author": null,
          "description": "Mar  9, 17:29 UTC\nResolved - This incident has been resolved.\nMar  9, 04:47 UTC\nMonitoring - A fix has been implemented and we are monitoring the results.\nMar  9, 04:47 UTC\nIdentified - The issue has been identified and a fix is being implemented.\nMar  8, 23:23 UTC\nInvestigating - We are currently investigating this issue.  The email subject is \"Action required: Enter your device password in the Rippling Desktop App\".  Employees can ignore this email for the time being.",
          "link": "https://status.rippling.com/incidents/y9wybwpbgtfd",
          "publishedOn": "2023-03-09T17:29:34.000Z",
          "wordCount": 4068,
          "title": "Devices app is sending an erroneous email prompting employees to enter their password",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        },
        {
          "id": "https://status.rippling.com/incidents/gwz9016ttd80",
          "author": null,
          "description": "Mar  8, 23:58 UTC\nResolved - This incident has been resolved.\nMar  8, 21:41 UTC\nMonitoring - Starting at 12:20 pacific time, we started seeing increased latency and intermittent API failures across all Rippling products. From 1 pm PT, latencies and API failures have recovered, and we are now continuing to monitor for any further issues.",
          "link": "https://status.rippling.com/incidents/gwz9016ttd80",
          "publishedOn": "2023-03-08T23:58:21.000Z",
          "wordCount": 4014,
          "title": "Increased latency and intermittent API failures",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/248858/rippling_favicoon.png"
        }
      ]
    },
    {
      "title": "Google Workspace Status Dashboard Updates",
      "feedUrl": "https://www.google.com/appsstatus/dashboard/en/feed.atom",
      "siteUrl": "https://www.google.com/appsstatus/dashboard/",
      "articles": [
        {
          "id": "https://www.google.com/appsstatus/dashboard/incidents/79iVdMKGvjfeHpdG2J6L",
          "author": null,
          "description": "<p> Incident began at <strong>2023-03-24 08:10</strong> and ended at <strong>2023-03-24 11:38</strong> <span>(times are in <strong>Coordinated Universal Time (UTC)</strong>).</span></p><div class=\"cBIRi14aVDP__status-update-text\"><h1>Incident Report</h1>\n<h2>Summary</h2>\n<p>On 24 March 2023, Google Workspace Support Chat experienced issues displaying some support language options for 3 hours, 28 minutes. As a result, some customers may have been unable to choose their preferred support language when starting a chat session.</p>\n<h2>Root Cause</h2>\n<p>When Google Workspace customers choose chat support, the Support UI displays a list of languages the customer may choose from before the chat session begins.</p>\n<p>On 24 March 2023 at 01:10 US/Pacific, engineers rolled out an update for the Support UI that migrated the language select dropdown to a new select component. This update introduced an issue where the rendering of the select component would cut off some language options when the number of available languages exceeded the select component’s container boundaries.</p>\n<h2>Remediation and Prevention</h2>\n<p>Google engineers were alerted to the issue via an internal report on 24 March 2023 at 03:27 US/Pacific and immediately started an investigation. Engineers identified the Support UI change as the cause of the issue at 04:13 US/Pacific and started a rollback of the update at 04:16 US/Pacific. The rollback finished at 04:38 US/Pacific, resolving the issue.</p>\n<p>Google is committed to preventing a repeat of this issue in the future and is completing the following actions:</p>\n<ul>\n<li>Update automated testing for Support UI releases to better detect these types of potential UI issues.</li>\n</ul>\n<h2>Detailed Description of Impact</h2>\n<p>On 24 March 2023 from 01:10 to 04:38 US/Pacific, Google Workspace Support Chat experienced issues displaying some support language options.</p>\n<p>Normally, all languages the customer is entitled to use should appear in the list of languages whether available or not. For the duration of this issue, Workspace support admins may have not seen their preferred language listed at all.</p>\n</div><hr><p>Affected products: Google Workspace Support</p>",
          "link": "https://www.google.com/appsstatus/dashboard/incidents/79iVdMKGvjfeHpdG2J6L",
          "publishedOn": "2023-03-31T21:53:34.000Z",
          "wordCount": 883,
          "title": "RESOLVED: We're investigating reports of an issue with Google Workspace Support. We will provide more information shortly.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "GitHub Status - Incident History",
      "feedUrl": "https://www.githubstatus.com/history.rss",
      "siteUrl": "https://www.githubstatus.com",
      "articles": [
        {
          "id": "https://www.githubstatus.com/incidents/5nlnzt80fk7g",
          "author": null,
          "description": "Apr  3, 22:41 UTC\nResolved - This incident has been resolved.\nApr  3, 22:17 UTC\nUpdate - We have mitigated the intermittent errors for Git requests and are continuing to monitor the system\nApr  3, 21:52 UTC\nUpdate - We are currently working to mitigate intermittent errors for Git requests\nApr  3, 21:32 UTC\nUpdate - We are currently investigating intermittent errors for Git requests\nApr  3, 20:57 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations.",
          "link": "https://www.githubstatus.com/incidents/5nlnzt80fk7g",
          "publishedOn": "2023-04-03T22:41:51.000Z",
          "wordCount": 4052,
          "title": "Incident with Git Operations",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/0d1bcqt29hm2",
          "author": null,
          "description": "Apr  3, 19:00 UTC\nResolved - This incident has been resolved.\nApr  3, 19:00 UTC\nUpdate - Actions is operating normally.\nApr  3, 18:43 UTC\nUpdate - We are investigating issues with workflow run failures when downloading actions.\nApr  3, 18:42 UTC\nUpdate - Pages is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nApr  3, 18:35 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/0d1bcqt29hm2",
          "publishedOn": "2023-04-03T19:00:40.000Z",
          "wordCount": 4052,
          "title": "Incident with Actions and Pages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/rmc0cpn9sn8w",
          "author": null,
          "description": "Mar 31, 02:08 UTC\nResolved - This incident has been resolved.\nMar 31, 01:39 UTC\nUpdate - We have identified the issue and are deploying a fix. We will update our status when the fix is fully deployed.\nMar 31, 01:18 UTC\nUpdate - Issues and Pull Requests are experiencing degraded performance. We are continuing to investigate.\nMar 31, 01:16 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations.",
          "link": "https://www.githubstatus.com/incidents/rmc0cpn9sn8w",
          "publishedOn": "2023-03-31T02:08:13.000Z",
          "wordCount": 4058,
          "title": "Incident with Git Operations, Issues and Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/z3c6q056q332",
          "author": null,
          "description": "Mar 29, 19:03 UTC\nResolved - This incident has been resolved.\nMar 29, 18:18 UTC\nUpdate - Codespaces is operating normally.\nMar 29, 18:13 UTC\nUpdate - We are still working towards full recovery. Actions jobs still experience delays when being queued.\nMar 29, 18:10 UTC\nUpdate - Pages is operating normally.\nMar 29, 17:41 UTC\nUpdate - We are still working towards full recovery. Actions jobs still experience delays when being queued.\nMar 29, 17:29 UTC\nUpdate - Codespaces is experiencing degraded performance. We are continuing to investigate.\nMar 29, 16:56 UTC\nUpdate - Actions workflows have started running again. We're continuing to work towards full recovery.\nMar 29, 16:47 UTC\nUpdate - Actions is now experiencing degraded performance. We are still investigating and will provide an update when we have one.\nMar 29, 16:22 UTC\nUpdate - We are seeing signs of recovery for Actions and continue to monitor closely. We will continue to post updates about progress as soon as we have them.\nMar 29, 15:42 UTC\nUpdate - We continue to work on mitigating the problems with Actions and Pages with high urgency. We will continue to post updates about our progress.\nMar 29, 15:29 UTC\nUpdate - Pages is experiencing degraded performance. We are continuing to investigate.\nMar 29, 14:56 UTC\nUpdate - We are still investigating the cause of Actions degradation, we will provide an update when we have one.\nMar 29, 14:43 UTC\nUpdate - Actions is now experiencing degraded availability. We are still investigating and will provide an update when we have one.\nMar 29, 14:21 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/z3c6q056q332",
          "publishedOn": "2023-03-29T19:03:08.000Z",
          "wordCount": 4273,
          "title": "Incident with Actions, Codespaces and Pages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/chnz8v3m9dqm",
          "author": null,
          "description": "Mar 28, 17:07 UTC\nResolved - This incident has been resolved.\nMar 28, 16:59 UTC\nUpdate - We've applied a mitigation to fix the issues with queuing and running Actions jobs. We are seeing improvements in telemetry and are monitoring for full recovery.\nMar 28, 16:28 UTC\nUpdate - The team continues to investigate issues with some Actions jobs being queued for a long time and a percentage of jobs failing. We will continue to keep users updated on progress towards mitigation.\nMar 28, 15:45 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/chnz8v3m9dqm",
          "publishedOn": "2023-03-28T17:07:30.000Z",
          "wordCount": 4062,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/52z0j6phhnjs",
          "author": null,
          "description": "Mar 27, 13:29 UTC\nResolved - This incident has been resolved.\nMar 27, 13:27 UTC\nUpdate - We’ve identified an infrastructure change that has been rolled back and we are monitoring recovery.\nMar 27, 13:22 UTC\nUpdate - Codespaces, Git Operations, Issues and Pull Requests are now experiencing degraded performance. We are still investigating and will provide an update when we have one.\nMar 27, 13:08 UTC\nUpdate - We are investigating reports of issues with service(s): multiple services. We will continue to keep users updated on progress towards mitigation.\nMar 27, 12:56 UTC\nUpdate - Issues and Pull Requests are now experiencing degraded availability. We are continuing to investigate.\nMar 27, 12:51 UTC\nUpdate - Pages is experiencing degraded performance. We are continuing to investigate.\nMar 27, 12:50 UTC\nUpdate - Codespaces is now experiencing degraded availability. We are continuing to investigate.\nMar 27, 12:50 UTC\nUpdate - Git Operations is now experiencing degraded availability. We are still investigating and will provide an update when we have one.\nMar 27, 12:35 UTC\nUpdate - Codespaces is experiencing degraded performance. We are continuing to investigate.\nMar 27, 12:33 UTC\nUpdate - API Requests is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nMar 27, 12:26 UTC\nUpdate - Actions is experiencing degraded performance. We are still investigating and will provide an update when we have one.\nMar 27, 12:25 UTC\nUpdate - Issues and Pull Requests are experiencing degraded performance. We are still investigating and will provide an update when we have one.\nMar 27, 12:25 UTC\nInvestigating - We are investigating reports of degraded performance for Git Operations.",
          "link": "https://www.githubstatus.com/incidents/52z0j6phhnjs",
          "publishedOn": "2023-03-27T13:29:09.000Z",
          "wordCount": 4300,
          "title": "Incident with Actions, API Requests, Codespaces, Git Operations, Issues, Pages and Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/ngfhz9jts91q",
          "author": null,
          "description": "Mar 26, 22:27 UTC\nResolved - This incident has been resolved.\nMar 26, 22:13 UTC\nInvestigating - We are investigating reports of degraded performance for Packages.",
          "link": "https://www.githubstatus.com/incidents/ngfhz9jts91q",
          "publishedOn": "2023-03-26T22:27:26.000Z",
          "wordCount": 3987,
          "title": "Incident with Packages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/x7njwb481j9b",
          "author": null,
          "description": "Mar 24, 21:10 UTC\nResolved - This incident has been resolved.\nMar 24, 21:05 UTC\nUpdate - We are aware of TLS problems related to an expired certificate in our CDN configuration. We are working to resolve this issue.\nMar 24, 20:49 UTC\nInvestigating - We are investigating reports of degraded performance for Pages.",
          "link": "https://www.githubstatus.com/incidents/x7njwb481j9b",
          "publishedOn": "2023-03-24T21:10:10.000Z",
          "wordCount": 4017,
          "title": "Incident with Pages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/rcjsf188vx7q",
          "author": null,
          "description": "Mar 24, 08:42 UTC\nResolved - This incident has been resolved.\nMar 24, 08:27 UTC\nInvestigating - We are investigating reports of degraded performance for Actions.",
          "link": "https://www.githubstatus.com/incidents/rcjsf188vx7q",
          "publishedOn": "2023-03-24T08:42:06.000Z",
          "wordCount": 3987,
          "title": "Incident with Actions",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/yc4d45cp0pxn",
          "author": null,
          "description": "Mar 23, 04:55 UTC\nResolved - This incident has been resolved.\nMar 23, 04:51 UTC\nUpdate - We have mitigated the issue and customers should have restored functionality to Codespaces. We are continue to monitor the issue for potential issues before resolving this\nMar 23, 04:08 UTC\nUpdate - We are investigating issues with Codespaces in the Europe West geographic area. Some users may not be able to connect to their Codespaces at this time. We will update you on mitigation progress.\nMar 23, 03:51 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/yc4d45cp0pxn",
          "publishedOn": "2023-03-23T04:55:17.000Z",
          "wordCount": 4062,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/rzqm3bfcn80x",
          "author": null,
          "description": "Mar 22, 22:41 UTC\nResolved - This incident has been resolved.\nMar 22, 22:26 UTC\nUpdate - We are continuing to investigate issues with Codespaces in the US West region.\nMar 22, 21:03 UTC\nUpdate - Some customers are currently unable to resume Codespaces created in the US West region. We are working to restore Codespaces to full functionality for those customers.\nMar 22, 20:31 UTC\nUpdate - We are investigating reports of degraded performance for Codespaces created in our US West 3 cluster.\nMar 22, 20:23 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/rzqm3bfcn80x",
          "publishedOn": "2023-03-22T22:41:58.000Z",
          "wordCount": 4066,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/8095qt814fr4",
          "author": null,
          "description": "Mar 21, 17:43 UTC\nResolved - This incident has been resolved.\nMar 21, 17:22 UTC\nInvestigating - We are investigating reports of degraded performance for Codespaces.",
          "link": "https://www.githubstatus.com/incidents/8095qt814fr4",
          "publishedOn": "2023-03-21T17:43:25.000Z",
          "wordCount": 3987,
          "title": "Incident with Codespaces",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/z5ykrdm7ykwg",
          "author": null,
          "description": "Mar 20, 17:01 UTC\nResolved - This incident has been resolved.\nMar 20, 16:44 UTC\nUpdate - We continue to investigate the cause of high latency across multiple GitHub services.\nMar 20, 16:02 UTC\nUpdate - We are investigating reports of high latency in issues, pull requests, and git operations.\nMar 20, 15:56 UTC\nInvestigating - We are investigating reports of degraded performance for API Requests, Git Operations, Issues and Pull Requests.",
          "link": "https://www.githubstatus.com/incidents/z5ykrdm7ykwg",
          "publishedOn": "2023-03-20T17:01:32.000Z",
          "wordCount": 4065,
          "title": "Incident with API Requests, Git Operations, Issues and Pull Requests",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/ybnn77s3lyf8",
          "author": null,
          "description": "Mar 15, 15:27 UTC\nResolved - This incident has been resolved.\nMar 15, 15:21 UTC\nUpdate - Packages is continuing to recover well. Error rates are back to normal and request latency continues to drop. Next update in 10 minutes.\nMar 15, 15:17 UTC\nUpdate - Packages is now experiencing degraded performance. We are continuing to investigate.\nMar 15, 15:10 UTC\nUpdate - Our mitigation for Packages is progressing well. We are adding capacity back and beginning to see 5xx error rates reduce. Next update in 10 minutes.\nMar 15, 14:52 UTC\nUpdate - Actions is experiencing degraded performance. We are continuing to investigate.\nMar 15, 14:51 UTC\nUpdate - Users of GitHub Package Registry (except Docker and Maven registries) will be experiencing timeout failures. This includes GitHub Actions, Packages API and Packages UI on GitHub.com.\nMar 15, 14:39 UTC\nUpdate - We have identified the source of the issue with GitHub Packages and are working to mitigate the problem.\nMar 15, 14:22 UTC\nUpdate - Pages is operating normally.\nMar 15, 14:20 UTC\nUpdate - Packages is now experiencing degraded availability. We are continuing to investigate.\nMar 15, 14:09 UTC\nUpdate - Packages is experiencing degraded performance. We are continuing to investigate.\nMar 15, 14:07 UTC\nInvestigating - We are investigating reports of degraded performance for Pages.",
          "link": "https://www.githubstatus.com/incidents/ybnn77s3lyf8",
          "publishedOn": "2023-03-15T15:27:21.000Z",
          "wordCount": 4209,
          "title": "Incident with Actions, Packages and Pages",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        },
        {
          "id": "https://www.githubstatus.com/incidents/dkm3dxjzynxh",
          "author": null,
          "description": "Mar  9, 16:36 UTC\nResolved - This incident has been resolved.\nMar  9, 16:07 UTC\nUpdate - We have found the cause of degraded Webhooks performance and are seeing signs of recovery.\nMar  9, 15:08 UTC\nUpdate - We are investigating reports of issues with Webhooks. We will continue to keep users updated on progress towards mitigation.\nMar  9, 14:34 UTC\nInvestigating - We are investigating reports of degraded performance for Webhooks.",
          "link": "https://www.githubstatus.com/incidents/dkm3dxjzynxh",
          "publishedOn": "2023-03-09T16:36:01.000Z",
          "wordCount": 4037,
          "title": "Incident with Webhooks",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
        }
      ]
    },
    {
      "title": "Slack System Status",
      "feedUrl": "https://status.slack.com/feed/rss",
      "siteUrl": "https://status.slack.com/",
      "articles": [
        {
          "id": "https://status.slack.com//2023-04/fdaa42009b1486bc",
          "author": null,
          "description": "Issue summary: \n\r\nOn April 3rd, 2023 from 11:00 AM PDT until 11:45 AM PDT, users on certain cellular service networks had issues receiving SMS texts for two-factor authentication (2FA). \n\r\n\r\nUpon investigation, this was traced to one unverified toll free number, which prevented 2FA codes from being approved for delivery. That number was removed from our 2FA pool, and services have resumed as usual. We are reviewing our process and alerting around outgoing phone number verification to ensure the issue doesn't happen again.",
          "link": "https://status.slack.com//2023-04/fdaa42009b1486bc",
          "publishedOn": "2023-04-03T21:29:44.000Z",
          "wordCount": 236,
          "title": "Incident: Some users have trouble receiving 2FA code via SMS",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-04/7c6ac904c99e5234",
          "author": null,
          "description": "Issue summary: \n\r\nFrom March 31st, 2023 at 7:18 PM PDT to April 1st, 2023 at 11:30 AM PDT, some customers may not have been able to sign in to Slack with the 'Continue with Google' feature. \n\r\n\r\nDuring a routine cleanup process, we made some changes to the project behind the 'Continue with Google' feature. This change inadvertently prevented the Slack mobile apps from confirming the validity of customer Google accounts during login. \n\r\n\r\nWe reverted this change, restoring normal login behaviour for all affected customers, and we're working to ensure it does not happen again. We apologize for any disruption to your work.",
          "link": "https://status.slack.com//2023-04/7c6ac904c99e5234",
          "publishedOn": "2023-04-02T03:27:35.000Z",
          "wordCount": 253,
          "title": "Incident: Some users are unable to sign-in using the Continue with Google feature on the Android and iOS app",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/a207156392d94ca4",
          "author": null,
          "description": "Issue summary:\n\r\nOn March 28th, 2023 from 2:40 PM to 3:43 PM PDT, some customers may have experienced difficulties editing messages in Slack. \n\r\n\r\nWe identified that this issue was caused by a recent code change. We reverted the code to resolve the issue for all impacted customers.",
          "link": "https://status.slack.com//2023-03/a207156392d94ca4",
          "publishedOn": "2023-03-30T19:14:47.000Z",
          "wordCount": 147,
          "title": "Incident: Some users may be unable to edit messages",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/c91b6fbe5d4397cd",
          "author": null,
          "description": "The issue with navigation of back/forward in history functionality is now resolved for all users.\n\r\n\r\nPlease reload Slack (press Command/Control + Shift + R) and let us know if you are still running into any issues.\n\r\n\r\nThank you very much for your patience while we worked on getting this fix out the door.",
          "link": "https://status.slack.com//2023-03/c91b6fbe5d4397cd",
          "publishedOn": "2023-03-24T23:33:44.000Z",
          "wordCount": 124,
          "title": "Incident: Some users may experience issues with using the back/forward in history functionality",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/851ee18978dd79cc",
          "author": null,
          "description": "Issue summary:\n\r\nOn March 21, 2023 at 7:32 AM PDT to March 22, 2023 at 8:06 AM PDT, the \"Time when workflow started\" variable is missing from all steps of the Workflow Builder for new and existing workflows. If the variable was used to publish to a Google Sheet, the cell would be empty.\n\r\n\r\nWe discovered a bug that made date fields invisible without any errors displayed, though workflows were still running and had access to the value.\n\r\n\r\nWe have released a fix on March 22, 2023 at 8:06 AM PDT. Previously impacted workflows need to retrieve the timestamps from the workflow in the Workflow Builder. We appreciate your patience while we sorted this out.",
          "link": "https://status.slack.com//2023-03/851ee18978dd79cc",
          "publishedOn": "2023-03-22T20:49:05.000Z",
          "wordCount": 489,
          "title": "Incident: “Time when workflow started” variable is missing from Workflow Builder steps",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/9011b8a984a74042",
          "author": null,
          "description": "We appreciate your patience while we've continued to investigate this issue. Some customers may still be impacted by the SSL certificate changes, however we will closely monitor reports and provide further updates through customer support tickets with the impacted users. Please reach out to our team at feedback@slack.com for further assistance.",
          "link": "https://status.slack.com//2023-03/9011b8a984a74042",
          "publishedOn": "2023-03-14T16:57:07.000Z",
          "wordCount": 161,
          "title": "Incident: Some users may experience issues accessing api.slack.com",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/1da534dc3612b14f",
          "author": null,
          "description": "Issue summary: \n\r\nOn March 13th, 2023 from 2:00 PM to 5:00 PM PDT, some Enterprise Grid customers using the Slack for Intune mobile app may have experienced errors or latency when logging in to Slack.\n\r\n\r\nWe identified that this issue was caused by a conflict between Slack functionality and a Slack for Intune preference. We deployed a manual fix, resolving the issue for all impacted users.",
          "link": "https://status.slack.com//2023-03/1da534dc3612b14f",
          "publishedOn": "2023-03-14T06:21:18.000Z",
          "wordCount": 206,
          "title": "Incident: Enterprise users see slowness or error messages when signing in on mobile",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/452b13772c8c8b7d",
          "author": null,
          "description": "Issue summary:\n\r\nOn March 9, 2023 from 8:28 PM to March 10, 2023 8:40 AM PST, some users that were signed into multiple workspaces experienced a redirect issue when signing into the Google Drive app from Slack. \n\r\n\r\nAfter the sign-in button was clicked, the user was redirected to a different Slack workspace they were signed into, causing a 400 Bad Request response.\n\r\n\r\nWe made a code change to ensure the user was redirected to the proper workspace, fixing the authentication error and resolving the issue.",
          "link": "https://status.slack.com//2023-03/452b13772c8c8b7d",
          "publishedOn": "2023-03-10T20:12:45.000Z",
          "wordCount": 179,
          "title": "Incident: Some customers are seeing errors when attempting to connect Google Drive",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/dd0ae32c5786a66f",
          "author": null,
          "description": "Issue summary:\n\r\nOn March 9, 2023 from 9:07 AM to 10:06 AM PST, some users experienced trouble with various features in Slack, such as adding bookmarks to channels, using workflows, connecting to Slack, or sending Slack Connect invites.\n\r\n\r\nWe discovered the service degradation was prompted by a load test that ran at a higher rate than intended, causing database outages to occur. To remediate the issue, we scaled back the load test to the normal rate which resolved the problem for all impacted users.",
          "link": "https://status.slack.com//2023-03/dd0ae32c5786a66f",
          "publishedOn": "2023-03-09T22:57:45.000Z",
          "wordCount": 195,
          "title": "Incident: Service degradation in Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        },
        {
          "id": "https://status.slack.com//2023-03/95e9c4b099d9b5bc",
          "author": null,
          "description": "Issue summary: \n\r\nOn March 7, 2023 from 9:15 AM to 6:31 PM PST, some users may have experienced slow search response times or failed searches.\n\r\n\r\nWe made a routine adjustment to our infrastructure that inadvertently increased load and decreased response rates for our search servers. New messages sent during this period were not indexed immediately and would not have been searchable.\n\r\n\r\nWe restarted the affected server nodes, returning search performance to normal and allowing the system to catch up on the backlogged indexing tasks. Once the system handled the backlog and we confirmed that indexing was complete, full search functionality was restored to all customers.\n\r\n\r\nThank you for your patience while we worked through this. We apologize for any disruption to your work.",
          "link": "https://status.slack.com//2023-03/95e9c4b099d9b5bc",
          "publishedOn": "2023-03-09T00:40:09.000Z",
          "wordCount": 215,
          "title": "Incident: Slowness searching in Slack",
          "imageUrl": "https://status.slack.com/img/v2_rebrand/slack_hash_256.png"
        }
      ]
    },
    {
      "title": "Make Status - Incident History",
      "feedUrl": "https://status.make.com/history.rss",
      "siteUrl": "https://status.make.com",
      "articles": [
        {
          "id": "https://status.make.com/incidents/kk37sgh6xp08",
          "author": null,
          "description": "Apr  3, 23:56 CEST\nUpdate - Twitter has suspended our app. We are continuing to investigate.\nApr  3, 21:29 CEST\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.make.com/incidents/kk37sgh6xp08",
          "publishedOn": "2023-04-03T21:56:40.000Z",
          "wordCount": 3220,
          "title": "Twitter app is down",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        },
        {
          "id": "https://status.make.com/incidents/0lcg8pdkx5yp",
          "author": null,
          "description": "Mar 24, 12:04 CET\nResolved - The issue was resolved.\nMar 24, 10:42 CET\nMonitoring - Scenario processing is stable now. We are closely monitoring the situation.\nMar 24, 10:29 CET\nInvestigating - We are currently investigating this issue.",
          "link": "https://status.make.com/incidents/0lcg8pdkx5yp",
          "publishedOn": "2023-03-24T11:04:31.000Z",
          "wordCount": 3262,
          "title": "Increased delay in scenarios executions for users on eu1.make.com since 10:00 CET",
          "imageUrl": "https://dka575ofm4ao0.cloudfront.net/assets/logos/favicon-2b86ed00cfa6258307d4a3d0c482fd733c7973f82de213143b24fc062c540367.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}